function 比奇旧世_执行(地图)
    if 主程.当前时间 > 地图.节点计时 then
        地图.节点计时 = 主程.当前时间:AddSeconds(1)
        if 地图.玩家列表.Count == 0 then
            return
        end
        if 地图.地图节点 == 0 then
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(5)
        elseif 地图.地图节点 == 1 then
            地图:地图公告("欢迎勇者们来到比奇旧世的战场。")
            ---网络服务网关:发送公告("比奇旧世怪物攻城战开始, 大批怪物即将出现在比奇旧世城中！",true)
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(5)
        elseif 地图.地图节点 == 2 then
            地图:地图公告("5秒后陆陆续续会有大批的怪物进入，勇者们请做好准备！")
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(5)
        elseif 地图.地图节点 == 3 then
            地图:地图公告("尸王带领大批手下到达战场！")
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.地图节点 == 4 then
            local 怪物刷新 = 获取副本怪物区域(地图, "僵尸类占领区域"):获取刷新范围()
            范围刷新怪物从地图实例("僵尸01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("僵尸02", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("僵尸03", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("僵尸04", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("僵尸05", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("堕落僵尸 二狗子", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("堕落僵尸 铁战", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("堕落僵尸 一支梅", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("僵尸护卫 杜杀", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("僵尸护卫 黑子", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("僵尸护卫 黑鹰", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("僵尸强盗 黑山", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("僵尸强盗 金豹", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("僵尸强盗 杜冷", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("和尚僵尸 玄空", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("和尚僵尸 玄绝", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("和尚僵尸 玄相", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("道士僵尸 人屠", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("道士僵尸 血手", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("道士僵尸 鬼阴", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("尸王02", 地图, 0, 怪物刷新, true, true, true, 10)
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.地图节点 == 5 then
            地图:地图公告("触龙神带领大批手下到达战场！")
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.地图节点 == 6 then
            local 怪物刷新 = 获取副本怪物区域(地图, "蜈蚣类占领区域"):获取刷新范围()
            范围刷新怪物从地图实例("蜈蚣01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("巨型蠕虫01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("钳虫01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("跳跳蜂01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("恶蛆02", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("剧毒蜈蚣", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("硬甲巨蠕虫", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("尖刺钳虫", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("变异跳跳蜂", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("暗夜舞者", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("邪恶钳虫", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("钻地幽龙 魔君", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("钻地幽龙 百足", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("钻地幽龙 毒七", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("巨蠕虫 死亡漩涡", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("巨蠕虫 远古虫王", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("巨蠕虫 尖脊鬼魅", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("钳虫 战不死", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("钳虫 锯骨狂", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("钳虫 凶目魔", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("杀人蜂 铁翼", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("杀人蜂 鬼影", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("杀人蜂 妖刀", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("触龙神01", 地图, 0, 怪物刷新, true, true, true, 10)
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.地图节点 == 7 then
            地图:地图公告("沃玛教主带领大批手下到达战场！")
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.地图节点 == 8 then
            local 怪物刷新 = 获取副本怪物区域(地图, "沃玛类占领区域"):获取刷新范围()
            范围刷新怪物从地图实例("暗黑战士02", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("沃玛战士02", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("沃玛勇士02", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("沃玛战将02", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("沃玛卫兵03", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("沃玛将领", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("火焰沃玛", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("沃玛斥候", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("堕落恶灵 守宫", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("堕落恶灵 刃魔", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("堕落恶灵 血主", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("疯魔卫 无畏", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("疯魔卫 铁蹄", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("疯魔卫 钢角", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("鬼域守卫 鬼面", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("鬼域守卫 羊钉", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("鬼域守卫 怒锤", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("烈焰神卫 炽目", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("烈焰神卫 炎足", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("烈焰神卫 沸血", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("裂地巨魔 折锐", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("裂地巨魔 风吼", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("裂地巨魔 断空", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("沃玛教主01", 地图, 0, 怪物刷新, true, true, true, 10)
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.地图节点 == 9 then
            地图:地图公告("虹魔教主带领大批手下到达战场！")
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.地图节点 == 10 then
            local 怪物刷新 = 获取副本怪物区域(地图, "石墓类占领区域"):获取刷新范围()
            范围刷新怪物从地图实例("红野猪02", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("黑野猪03", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("白野猪01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("白野猪暴徒", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("恶蛆头目01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("红野猪头目01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("黑野猪头目01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("尖牙卫 铁头", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("尖牙卫 血煞", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("尖牙卫 骨魔", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("咆哮战士 钢鬃", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("咆哮战士 黑风", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("咆哮战士 腐牙", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("虹魔猪卫 战刃", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("虹魔猪卫 无天", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("虹魔猪卫 印忠", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("虹魔蝎卫 鬼藏", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("虹魔蝎卫 毒锋", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("虹魔蝎卫 绝刀", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("邪血卫士 狂徒", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("邪血卫士 锐爪", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("邪血卫士 猛鬼", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("虹魔教主01", 地图, 0, 怪物刷新, true, true, true, 10)
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.地图节点 == 11 then
            地图:地图公告("祖玛教主带领大批手下到达战场！")
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.地图节点 == 12 then
            local 怪物刷新 = 获取副本怪物区域(地图, "祖玛类占领区域"):获取刷新范围()
            范围刷新怪物从地图实例("祖玛老鼠01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛卫士01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛雕像01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛弓箭手01", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛卫士头目02", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛弓箭手头目02", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛雕像头目02", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛鼠卫 妖风", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛鼠卫 长牙", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛鼠卫 灵爪", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("石像守卫 劈颅", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("石像守卫 灾狱", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("石像守卫 夜冥", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛弓卫 幽刹", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛弓卫 影魔", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛弓卫 鹰角", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛卫士 凶面", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛卫士 疯徒", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛卫士 狂煞", 地图, 0, 怪物刷新, true, true, true, 10)
            范围刷新怪物从地图实例("祖玛教主01", 地图, 0, 怪物刷新, true, true, true, 10)
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.地图节点 == 13 then
            if 当前小时 == 21 and 当前分钟 >= 1 or 当前小时 == 21 and 当前分钟 >= 1 then
                地图:地图公告("比奇旧世怪物攻城战已经结束！")
                地图.地图节点 = 地图.地图节点 + 1
                地图.节点计时 = 主程.当前时间:AddSeconds(2)
            end
        elseif 地图.地图节点 == 14 then
            地图:地图公告("5秒后玩家自动比奇旧世。")
            地图:地图清理怪物()
            地图.地图节点 = 地图.地图节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(5)
        elseif 地图.地图节点 == 15 then
            地图:地图清理玩家()
            地图:地图清理对象()
            地图.地图节点 = 0
            地图.节点计时 = 主程.当前时间:AddSeconds(5)
        end
    end
end
