

喋血之路陷阱刷新怪物表 = {
   { "落石", "炸弹", "飞轮" },
}

local 陷阱刷新间隔 = 30

function 喋血之路_执行(地图)
    if 主程.当前时间 > 地图.节点计时 then
        local 品质 = 地图.数字变量[数字_无相之境品质]
        local 等级 = 地图.数字变量[数字_无相之境等级]
        if 地图.玩家列表.Count == 0 then
            地图.副本节点 = 255
        end
        if 地图.副本节点 == 255 then
            地图:关闭副本()
        elseif 地图.副本节点 == 0 then
            if 品质 == 0 then
                地图:地图公告("喋血之路[白][".. 等级 .."]秘境的封印已解除！ 望各位勇士量力而行，莫要有来无归！")
            elseif 品质 == 1 then
                地图:地图公告("喋血之路[绿][".. 等级 .."]秘境的封印已解除！ 望各位勇士量力而行，莫要有来无归！")
            elseif 品质 == 2 then
                地图:地图公告("喋血之路[蓝][".. 等级 .."]秘境的封印已解除！ 望各位勇士量力而行，莫要有来无归！")
            elseif 品质 == 3 then
                地图:地图公告("喋血之路[紫][".. 等级 .."]秘境的封印已解除！ 望各位勇士量力而行，莫要有来无归！")
            elseif 品质 == 4 then
                地图:地图公告("喋血之路[橙][".. 等级 .."]秘境的封印已解除！ 望各位勇士量力而行，莫要有来无归！")
            end
            地图.副本节点 = 地图.副本节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(5)
        elseif 地图.副本节点 == 1 then
            地图:地图公告("只有消灭喋血之路所有的怪物才能在[熄焰恶魔]处领取奖励！")
            地图.副本节点 = 地图.副本节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(5)
        elseif 地图.副本节点 == 2 then
            地图.副本节点 = 地图.副本节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(5)
            地图:地图公告("喋血之路秘境中的小妖和妖王已经现身,请勇士速速前往击杀！！！")
            local 怪物刷新 = 获取副本怪物区域(地图, "喋血之路-刷怪区域"):获取刷新范围()
            local 精英刷新 = 获取副本怪物区域(地图, "喋血之路-刷怪区域"):获取刷新范围()
            local BOSS刷新 = 获取副本怪物区域(地图, "喋血之路-BOSS区域"):获取刷新范围()
            if 品质 == 0 then
                if 等级 == 40 then
                    范围刷新怪物从地图实例("小树妖2867", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("稻草人2868", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("山洞蝙蝠2899", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("树妖2871", 地图, 0, 精英刷新, true, true, true, 10)
                    范围刷新怪物从地图实例("钉耙猫2872", 地图, 0, BOSS刷新, true, true, true, 1)
                elseif 等级 == 45 then
                    范围刷新怪物从地图实例("山洞蝙蝠2899", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("沃玛战士2900", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("恶蛆2906", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("火焰沃玛2904", 地图, 0, 精英刷新, true, true, true, 10)
                    范围刷新怪物从地图实例("沃玛教主2905", 地图, 0, BOSS刷新, true, true, true, 1)
                elseif 等级 == 50 then
                    范围刷新怪物从地图实例("恶蛆2906", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("红野猪2907", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛老鼠2913", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("猪卫斧2911", 地图, 0, 精英刷新, true, true, true, 15)
                    范围刷新怪物从地图实例("虹魔教主2912", 地图, 0, BOSS刷新, true, true, true, 2)
                elseif 等级 == 55 then
                    范围刷新怪物从地图实例("祖玛老鼠2913", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛卫士2914", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("月魔蜘蛛2801", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("精英雕像2917", 地图, 0, 精英刷新, true, true, true, 15)
                    范围刷新怪物从地图实例("祖玛教主2919", 地图, 0, BOSS刷新, true, true, true, 2)
                elseif 等级 == 60 then
                    范围刷新怪物从地图实例("月魔蜘蛛2801", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("天狼蜘蛛2802", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙邪眼2814", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("花吻蜘蛛 幻花2805", 地图, 0, 精英刷新, true, true, true, 20)
                    范围刷新怪物从地图实例("幻影蜘蛛2806", 地图, 0, BOSS刷新, true, true, true, 3)
                elseif 等级 == 65 then
                    范围刷新怪物从地图实例("魔龙邪眼2814", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙刀兵2815", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("小树妖2867", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙力士 千斤斩2818", 地图, 0, 精英刷新, true, true, true, 20)
                    范围刷新怪物从地图实例("魔龙巨蛾 诱幻2820", 地图, 0, BOSS刷新, true, true, true, 3)
                end
            elseif 品质 == 1 then
                if 等级 == 40 then
                    范围刷新怪物从地图实例("小树妖2867", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("稻草人2868", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("钉耙猫2869", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("山洞蝙蝠2899", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("树妖2871", 地图, 0, 精英刷新, true, true, true, 10)
                    范围刷新怪物从地图实例("钉耙猫2872", 地图, 0, BOSS刷新, true, true, true, 1)
                 elseif 等级 == 45 then
                    范围刷新怪物从地图实例("山洞蝙蝠2899", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("沃玛勇士2901", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("恶蛆2906", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("火焰沃玛2904", 地图, 0, 精英刷新, true, true, true, 10)
                    范围刷新怪物从地图实例("沃玛教主2905", 地图, 0, BOSS刷新, true, true, true, 1)
                 elseif 等级 == 50 then
                    范围刷新怪物从地图实例("恶蛆2906", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("黑野猪2908", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛老鼠2913", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("猪卫斧2911", 地图, 0, 精英刷新, true, true, true, 15)
                    范围刷新怪物从地图实例("虹魔教主2912", 地图, 0, BOSS刷新, true, true, true, 2)
                 elseif 等级 == 55 then
                    范围刷新怪物从地图实例("祖玛老鼠2913", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛雕像2915", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("月魔蜘蛛2801", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("精英雕像2917", 地图, 0, 精英刷新, true, true, true, 15)
                    范围刷新怪物从地图实例("祖玛教主2919", 地图, 0, BOSS刷新, true, true, true, 2)
                 elseif 等级 == 60 then
                    范围刷新怪物从地图实例("月魔蜘蛛2801", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("黑锷蜘蛛2803", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙邪眼2814", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("花吻蜘蛛 幻花2805", 地图, 0, 精英刷新, true, true, true, 20)
                    范围刷新怪物从地图实例("幻影蜘蛛2806", 地图, 0, BOSS刷新, true, true, true, 3)
                 elseif 等级 == 65 then
                    范围刷新怪物从地图实例("魔龙邪眼2814", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙破甲兵2816", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("小树妖2867", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙力士 千斤斩2818", 地图, 0, 精英刷新, true, true, true, 20)
                    范围刷新怪物从地图实例("魔龙巨蛾 诱幻2820", 地图, 0, BOSS刷新, true, true, true, 3)
                 end
            elseif 品质 == 2 then
                if 等级 == 40 then
                    范围刷新怪物从地图实例("小树妖2867", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("稻草人2868", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("海蟹2870", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("山洞蝙蝠2899", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("树妖2871", 地图, 0, 精英刷新, true, true, true, 10)
                    范围刷新怪物从地图实例("钉耙猫2872", 地图, 0, BOSS刷新, true, true, true, 1)
                elseif 等级 == 45 then
                    范围刷新怪物从地图实例("山洞蝙蝠2899", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("沃玛战将2902", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("红野猪2907", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("火焰沃玛2904", 地图, 0, 精英刷新, true, true, true, 10)
                    范围刷新怪物从地图实例("沃玛教主2905", 地图, 0, BOSS刷新, true, true, true, 1)
                elseif 等级 == 50 then
                    范围刷新怪物从地图实例("红野猪2907", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("黑野猪2908", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛老鼠2913", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("猪卫斧2911", 地图, 0, 精英刷新, true, true, true, 15)
                    范围刷新怪物从地图实例("虹魔教主2912", 地图, 0, BOSS刷新, true, true, true, 2)
                elseif 等级 == 55 then
                    范围刷新怪物从地图实例("祖玛老鼠2913", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛弓箭手2916", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("月魔蜘蛛2801", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("精英雕像2917", 地图, 0, 精英刷新, true, true, true, 15)
                    范围刷新怪物从地图实例("祖玛教主2919", 地图, 0, BOSS刷新, true, true, true, 2)
                elseif 等级 == 60 then
                    范围刷新怪物从地图实例("月魔蜘蛛2801", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("天狼蜘蛛2802", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("暴牙蜘蛛2804", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙邪眼2814", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("花吻蜘蛛 幻花2805", 地图, 0, 精英刷新, true, true, true, 20)
                    范围刷新怪物从地图实例("幻影蜘蛛2806", 地图, 0, BOSS刷新, true, true, true, 3)
                elseif 等级 == 65 then
                    范围刷新怪物从地图实例("魔龙邪眼2814", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙射手2817", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("小树妖2867", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("山洞蝙蝠2899", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙力士 千斤斩2818", 地图, 0, 精英刷新, true, true, true, 20)
                    范围刷新怪物从地图实例("魔龙巨蛾 诱幻2820", 地图, 0, BOSS刷新, true, true, true, 3)
                end
            elseif 品质 == 3 then
                if 等级 == 40 then
                    范围刷新怪物从地图实例("小树妖2867", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("海蟹2870", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("钉耙猫2869", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("红野猪2907", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("树妖2871", 地图, 0, 精英刷新, true, true, true, 10)
                    范围刷新怪物从地图实例("钉耙猫2872", 地图, 0, BOSS刷新, true, true, true, 1)
                elseif 等级 == 45 then
                    范围刷新怪物从地图实例("山洞蝙蝠2899", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("暗黑战士2903", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("沃玛勇士2901", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("红野猪2907", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("火焰沃玛2904", 地图, 0, 精英刷新, true, true, true, 10)
                    范围刷新怪物从地图实例("沃玛教主2905", 地图, 0, BOSS刷新, true, true, true, 1)
                elseif 等级 == 50 then
                    范围刷新怪物从地图实例("红野猪2907", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("黑野猪2908", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("白野猪2909", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛老鼠2913", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("猪卫斧2911", 地图, 0, 精英刷新, true, true, true, 15)
                    范围刷新怪物从地图实例("虹魔教主2912", 地图, 0, BOSS刷新, true, true, true, 2)
                elseif 等级 == 55 then
                    范围刷新怪物从地图实例("祖玛老鼠2913", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛卫士2914", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛雕像2915", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("月魔蜘蛛2801", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("精英卫士2918", 地图, 0, 精英刷新, true, true, true, 15)
                    范围刷新怪物从地图实例("祖玛教主2919", 地图, 0, BOSS刷新, true, true, true, 2)
                elseif 等级 == 60 then
                    范围刷新怪物从地图实例("月魔蜘蛛2801", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("黑锷蜘蛛2803", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("暴牙蜘蛛2804", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙邪眼2814", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("花吻蜘蛛 幻花2805", 地图, 0, 精英刷新, true, true, true, 20)
                    范围刷新怪物从地图实例("幻影蜘蛛2806", 地图, 0, BOSS刷新, true, true, true, 3)
                elseif 等级 == 65 then
                    范围刷新怪物从地图实例("魔龙邪眼2814", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙刀兵2815", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙破甲兵2816", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("小树妖2867", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙战将 阴杀2819", 地图, 0, 精英刷新, true, true, true, 20)
                    范围刷新怪物从地图实例("魔龙巨蛾 诱幻2820", 地图, 0, BOSS刷新, true, true, true, 3)
                end
            elseif 品质 == 4 then
                if 等级 == 40 then
                    范围刷新怪物从地图实例("小树妖2867", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("稻草人2868", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("钉耙猫2869", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("海蟹2870", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("山洞蝙蝠2899", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("树妖2871", 地图, 0, 精英刷新, true, true, true, 10)
                    范围刷新怪物从地图实例("钉耙猫2872", 地图, 0, BOSS刷新, true, true, true, 1)
                elseif 等级 == 45 then
                    范围刷新怪物从地图实例("山洞蝙蝠2899", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("沃玛战士2900", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("沃玛勇士2901", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("暗黑战士2903", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("红野猪2907", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("火焰沃玛2904", 地图, 0, 精英刷新, true, true, true, 10)
                    范围刷新怪物从地图实例("沃玛教主2905", 地图, 0, BOSS刷新, true, true, true, 1)
                elseif 等级 == 50 then
                    范围刷新怪物从地图实例("红野猪2907", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("黑野猪2908", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("白野猪2909", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("野猪射手2910", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛老鼠2913", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("猪卫斧2911", 地图, 0, 精英刷新, true, true, true, 15)
                    范围刷新怪物从地图实例("虹魔教主2912", 地图, 0, BOSS刷新, true, true, true, 2)
                elseif 等级 == 55 then
                    范围刷新怪物从地图实例("祖玛老鼠2913", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛卫士2914", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛雕像2915", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("祖玛弓箭手2916", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("月魔蜘蛛2801", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("精英卫士2918", 地图, 0, 精英刷新, true, true, true, 15)
                    范围刷新怪物从地图实例("祖玛教主2919", 地图, 0, BOSS刷新, true, true, true, 2)
                elseif 等级 == 60 then
                    范围刷新怪物从地图实例("月魔蜘蛛2801", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("天狼蜘蛛2802", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("黑锷蜘蛛2803", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("暴牙蜘蛛2804", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙邪眼2814", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("花吻蜘蛛 幻花2805", 地图, 0, 精英刷新, true, true, true, 20)
                    范围刷新怪物从地图实例("幻影蜘蛛2806", 地图, 0, BOSS刷新, true, true, true, 3)
                elseif 等级 == 65 then
                    范围刷新怪物从地图实例("魔龙邪眼2814", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙刀兵2815", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙破甲兵2816", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙射手2817", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("楔蛾2893", 地图, 0, 怪物刷新, true, true, true, 25)
                    范围刷新怪物从地图实例("魔龙战将 阴杀2819", 地图, 0, 精英刷新, true, true, true, 20)
                    范围刷新怪物从地图实例("魔龙巨蛾 诱幻2820", 地图, 0, BOSS刷新, true, true, true, 3)
                end
            end
        elseif 地图.副本节点 == 3 then
            local 陷阱刷新 = 获取副本怪物区域(地图, "喋血之路-陷阱区域"):获取刷新范围()
            if 地图.存活怪物总数 ~= 0 then
                if 主程.当前时间 > 地图.节点计时 then
                    地图:地图公告("副本中的怪物还存活着[".. 地图.存活怪物总数 .."]只。")
                    local 玩家列表 = 地图:获取玩家列表()
                    for i = 0, 玩家列表.Count - 1 do
                        local 玩家 = 玩家列表[i]
                        玩家:发送系统消息("副本中的怪物还存活着[".. 地图.存活怪物总数 .."]只。")
                    end
                    地图.节点计时 = 主程.当前时间:AddSeconds(60)
                end
                if 陷阱刷新间隔 ~= 0 and 主程.当前时间 > 地图.节点计时 then
                    陷阱刷新间隔 = 陷阱刷新间隔 - 1
                    地图.节点计时 = 主程.当前时间:AddSeconds(1)
                elseif 数字_陷阱刷新间隔 == 0 and 陷阱刷新 ~= nil then
                    if 品质 == 0 then
                        if 等级 == 40 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 45 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 50 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 55 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 60 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 65 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        end
                    elseif 品质 == 1 then
                       if 等级 == 40 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 45 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 50 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 55 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 60 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 65 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        end
                    elseif 品质 == 2 then
                        if 等级 == 40 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 45 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 50 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 55 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 60 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 65 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        end
                    elseif 品质 == 3 then
                        if 等级 == 40 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 45 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 50 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 55 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 60 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 65 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        end
                    elseif 品质 == 4 then
                        if 等级 == 40 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 45 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 50 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 55 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 60 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        elseif 等级 == 65 then
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                            范围刷新怪物从地图实例(从表随机取值(喋血之路陷阱刷新怪物表[1]), 地图, 0, 陷阱刷新, true, true)
                        end
                    end
                    陷阱刷新间隔 = 40
                end
            else
                地图.副本节点 = 地图.副本节点 + 1
                地图.节点计时 = 主程.当前时间:AddSeconds(1.0)
            end
        elseif 地图.副本节点 == 4 and 地图.存活怪物总数 == 0 then
            local 总值 = 等级 * 10 + 品质
            local 玩家列表 = 地图:获取玩家列表()
            for i = 0, 玩家列表.Count - 1 do
                local 玩家 = 玩家列表[i]
                if 总值 > 玩家.角色数据.零点数字[数字_无相秘境个人品质记录] then
                    玩家.角色数据.零点数字[数字_无相秘境个人品质记录] = 总值
                end
                地图:地图公告("副本中的怪物已经清空！请阁下去[熄焰恶魔]处领取【喋血之路】副本奖励！")
				刷新守卫从地图实例(6185, 地图, 游戏方向.下方, Point(925, 760))
                地图.节点计时 = 主程.当前时间:AddHours(2.0)
            end
        else
            地图.节点计时 = 主程.当前时间:AddSeconds(2.0)
        end
    end
end
