

local 试炼怪物 = {
    [63] = {"沃玛教主(试炼)5711","触龙神(试炼)5712","虹魔教主(试炼)5713","祖玛教主(试炼)5714","血手(试炼)5715","赤月恶魔(试炼)5716","烈焰恶魔(试炼)5717","魔龙教主(试炼)5718","牛魔王(试炼)5719","黄泉教主(试炼)5720"},
    [111] = {"沃玛教主(试炼)5711","触龙神(试炼)5712","虹魔教主(试炼)5713","祖玛教主(试炼)5714","血手(试炼)5715","赤月恶魔(试炼)5716","烈焰恶魔(试炼)5717","魔龙教主(试炼)5718","牛魔王(试炼)5719","黄泉教主(试炼)5720"},
    [118] = {"沃玛教主(试炼)5711","触龙神(试炼)5712","虹魔教主(试炼)5713","祖玛教主(试炼)5714","血手(试炼)5715","赤月恶魔(试炼)5716","烈焰恶魔(试炼)5717","魔龙教主(试炼)5718","牛魔王(试炼)5719","黄泉教主(试炼)5720"},
    [162] = {"沃玛教主(试炼)5711","触龙神(试炼)5712","虹魔教主(试炼)5713","祖玛教主(试炼)5714","血手(试炼)5715","赤月恶魔(试炼)5716","烈焰恶魔(试炼)5717","魔龙教主(试炼)5718","牛魔王(试炼)5719","黄泉教主(试炼)5720"},
    [195] = {"沃玛教主(试炼)5711","触龙神(试炼)5712","虹魔教主(试炼)5713","祖玛教主(试炼)5714","血手(试炼)5715","赤月恶魔(试炼)5716","烈焰恶魔(试炼)5717","魔龙教主(试炼)5718","牛魔王(试炼)5719","黄泉教主(试炼)5720"},
    [242] = {"沃玛教主(试炼)5711","触龙神(试炼)5712","虹魔教主(试炼)5713","祖玛教主(试炼)5714","血手(试炼)5715","赤月恶魔(试炼)5716","烈焰恶魔(试炼)5717","魔龙教主(试炼)5718","牛魔王(试炼)5719","黄泉教主(试炼)5720"}
}

function 试炼幻境_执行(地图)
    if 主程.当前时间 > 地图.节点计时 then
        if 地图.玩家列表.Count == 0 then
            地图.副本节点 = 255
        end
        if 地图.副本节点 == 1 then
            地图:地图公告("勇者试炼将在10秒后开始，请勇士们做好准备")
            地图.副本节点 = 地图.副本节点 + 1
            地图.节点计时 = 主程.当前时间:AddSeconds(10)
        elseif 地图.副本节点 == 2 then
            地图:地图公告("强大的怪物出现了，击败它赢得荣誉和奖励吧！")
            if 地图.试炼之地编号 == 63 then --牛魔寺庙四层
                范围刷新怪物从地图实例(从表随机取值(试炼怪物[63]), 地图, 0, Point(1020, 116), true, true)
            elseif 地图.试炼之地编号 == 111 then --陵墓浅表
                范围刷新怪物从地图实例(从表随机取值(试炼怪物[111]), 地图, 0, Point(1020, 116), true, true)
            elseif 地图.试炼之地编号 == 118 then --龙血地脉
                范围刷新怪物从地图实例(从表随机取值(试炼怪物[118]), 地图, 0, Point(1020, 116), true, true)
            elseif 地图.试炼之地编号 == 162 then --石墓五层
                范围刷新怪物从地图实例(从表随机取值(试炼怪物[162]), 地图, 0, Point(1020, 116), true, true)
            elseif 地图.试炼之地编号 == 195 then --抉择之地
                范围刷新怪物从地图实例(从表随机取值(试炼怪物[195]), 地图, 0, Point(1020, 116), true, true)
            elseif 地图.试炼之地编号 == 242 then --魔龙谷
                范围刷新怪物从地图实例(从表随机取值(试炼怪物[242]), 地图, 0, Point(1020, 116), true, true)
            end
            地图.节点计时 = 主程.当前时间:AddSeconds(1)
            地图.副本节点 = 地图.副本节点 + 1
        elseif 地图.副本节点 == 3 then
            if 地图.存活怪物总数 == 0 then
                刷新守卫从地图实例(6995, 地图, 游戏方向.下方, Point(1020, 116))
                地图.副本节点 = 4
            end
            地图.节点计时 = 主程.当前时间:AddSeconds(1)
        elseif 地图.副本节点 == 4 then
            地图.节点计时 = 主程.当前时间:AddSeconds(1)
        elseif 地图.副本节点 == 255 then
            地图:关闭副本()
        end
    end
end