function player_wp(玩家, 物品) -- 使用物品
    if 玩家.管理员模式 then
        -- 采集实例(3496, 玩家.当前地图, 玩家.当前方向, 玩家.当前坐标, 1)
        玩家:发送系统消息("当前节点[" .. 主程.开区节点 .. "]-编号[" .. 物品.物品编号 .. "]-地图编号[" .. 玩家.当前地图.地图编号 .. "]坐标[" .. 玩家.当前坐标.X .."][" .. 玩家.当前坐标.Y .. "]")
    end

    -- if 物品.物品编号 == 2212 then
    --     玩家:消耗背包物品(1, 物品)
    --     采集实例(3480, 玩家.当前地图, 玩家.当前方向, 玩家.当前坐标, 1)
    --     return 1
    -- end

    if 物品.物品编号 == 1500101 then --感恩礼包
        玩家:消耗背包物品(1, 物品)
        玩家.金币数量 = 玩家.金币数量 + 300000
        玩家:玩家获得物品(获取职业铭文石(玩家), 5, "宣传礼包", true)
        玩家:玩家获得物品(80201, 1, "宣传礼包", true)
        玩家:玩家获得物品(80202, 1, "宣传礼包", true)
        玩家:玩家获得物品(80206, 1, "宣传礼包", true)
        return 1
    end

    if 物品.物品编号 == 1000013 then -- 战场礼包
        玩家:消耗背包物品(1, 物品)
        玩家.金币数量 = 玩家.金币数量 + 500000
        玩家:玩家获得物品(获取职业铭文石(玩家), 10, "战场礼包", true)
        玩家:玩家获得物品(80201, 1, "战场礼包", true)
        玩家:玩家获得物品(80202, 1, "战场礼包", true)
        玩家:玩家获得物品(80206, 1, "战场礼包", true)
    end

    if 物品.物品编号 == 1029001 then
        if 玩家.背包剩余 < 1 then
            玩家:发送顶部公告("背包剩余格数不足[1]格，无法打开礼包。",false,false)
            玩家:发送系统消息("背包剩余格数不足[1]格，无法打开礼包。")
        elseif 计算概率(0.2) then
            local 皇室宝箱 = {
                [1029001] =
                {
                    99990316, 99990326, 99990336, 99990346, 99990356, 99990366, 99900018, 99900019, 99900021, 99900054, 99900075, 99900103, 99920016, 99920020, 99920021, 99920044, 99920073, 99930014, 99930017, 99930018, 99930048, 99930074, 99940011, 99940015, 99940020, 99940037, 99940072, 99990411, 99980413, 99990413, 99980423, 99990423, 99980433, 99990433, 99980443, 99990443, 99980453, 99990453, 99980463, 99990463, 99990415, 99990417
                }
            }
            local 给与物品 = 玩家:玩家获得物品(皇室宝箱[物品.物品编号][randomNum(1,42,false)], 1)
            给与物品.当前持久.V = 给与物品.最大持久.V
            玩家:更新物品详情(给与物品)
            玩家:消耗背包物品(1, 物品)
        else
            玩家:玩家获得物品(418,1)
            玩家:消耗背包物品(1, 物品)
        end
        return 1
    end

    if 物品.物品编号 == 1023001 then -- 暗殿-铜箱子
        local 所需物品 = 玩家:查找背包物品(91164, 1)
        if 所需物品 ~= nil then
            if 玩家.背包剩余 >= 1 then
                玩家:消耗背包物品(1, 所需物品)
                玩家:消耗背包物品(1, 物品)
                if 计算概率(0.2) then
                    local 暗殿宝箱装备表 = {
                        [1023001] = {99961001, 99961002, 99961003, 99961004, 99961005, 99961006, 99920017, 99920018, 99920019, 99920045, 99920074, 99920084, 99930019, 99930020, 99930021, 99930049, 99930075, 99930085, 99940010, 99940012, 99940016, 99940021, 99940038, 99940073, 99940083},--暗殿宝箱·铜
                    }
                    local 给与物品 = 玩家:玩家获得物品(暗殿宝箱装备表[物品.物品编号][randomNum(1,25,false)], 1)
                    给与物品.当前持久.V = 给与物品.最大持久.V
                    玩家:更新物品详情(给与物品)
                else
                    local 暗殿宝箱装备表 = {
                        [1023001] = {111061, 111062, 111063, 111064, 80003},--暗殿宝箱·铜
                    }
                    玩家:玩家获得物品(暗殿宝箱装备表[物品.物品编号][randomNum(1,5,false)], 1)
                end
            else
                玩家:发送顶部公告("背包剩余格数不足[1]格，无法打开礼包。",false,false)
                玩家:发送系统消息("背包剩余格数不足[1]格，无法打开礼包。")
            end
        else
            玩家:发送顶部公告("开启宝箱所需（暗殿钥匙·铜）一把",false,false)
            玩家:发送系统消息("开启宝箱所需（暗殿钥匙·铜）一把")
        end
        return 1
    end

    if 物品.物品编号 == 1023002 then -- 暗殿-银箱子
        local 所需物品 = 玩家:查找背包物品(91165, 1)
        if 所需物品 ~= nil then
            if 玩家.背包剩余 >= 1 then
                玩家:消耗背包物品(1, 所需物品)
                玩家:消耗背包物品(1, 物品)
                local 暗殿宝箱装备表 = {
                    [1023002] = {99961001, 99961002, 99961003, 99961004, 99961005, 99961006, 99920027, 99920028, 99920029, 99920046, 99920075, 99920085, 99930033, 99930034, 99930035, 99930050, 99930076, 99930086, 99940024, 99940025, 99940026, 99940039, 99940074, 99940084, 99990611, 99990621, 99990631, 99990641, 99990651, 99990661},--暗殿宝箱·银
                }
                local 给与物品 = 玩家:玩家获得物品(暗殿宝箱装备表[物品.物品编号][randomNum(1,30,false)], 1)
                给与物品.当前持久.V = 给与物品.最大持久.V
                玩家:更新物品详情(给与物品)
            else
                玩家:发送顶部公告("背包剩余格数不足[1]格，无法打开礼包。",false,false)
                玩家:发送系统消息("背包剩余格数不足[1]格，无法打开礼包。")
            end
        else
            玩家:发送顶部公告("开启宝箱所需（暗殿钥匙·银）一把",false,false)
            玩家:发送系统消息("开启宝箱所需（暗殿钥匙·银）一把")
        end
        return 1
    end

    if 物品.物品编号 == 1023003 then -- 暗殿-金箱子
        local 所需物品 = 玩家:查找背包物品(91166, 1)
        if 所需物品 ~= nil then
            if 玩家.背包剩余 >= 1 then
                玩家:消耗背包物品(1, 所需物品)
                玩家:消耗背包物品(1, 物品)
                if 计算概率(0.2) then
                    local 暗殿宝箱装备表 = {
                        [1023003] = { 99920032, 99920033, 99920034, 99920047, 99920076, 99920086, 99930038, 99930039, 99930040, 99930051, 99930077, 99930087, 99940030, 99940031, 99940032, 99940040, 99940075, 99940085, 99990715, 99990725, 99990735, 99990745, 99990755, 99990765, 99990717, 99990727, 99990737, 99990747, 99990757, 99990767}
                    }
                    local 给与物品 = 玩家:玩家获得物品(暗殿宝箱装备表[物品.物品编号][randomNum(1,30,false)], 1)
                    给与物品.当前持久.V = 给与物品.最大持久.V
                    玩家:更新物品详情(给与物品)
                else
                    local 暗殿宝箱装备表 = {
                        [1023003] = {91125, 80003},--暗殿宝箱·金
                    }
                    玩家:玩家获得物品(暗殿宝箱装备表[物品.物品编号][randomNum(1,2,false)], 1)
                end
            else
                玩家:发送顶部公告("背包剩余格数不足[1]格，无法打开礼包。",false,false)
                玩家:发送系统消息("背包剩余格数不足[1]格，无法打开礼包。")
            end
        else
            玩家:发送顶部公告("开启宝箱所需（暗殿钥匙·金）一把",false,false)
            玩家:发送系统消息("开启宝箱所需（暗殿钥匙·金）一把")
        end
        return 1
    end
----------------------------------------------------------------------------------------------------------------------
--  多个普通物品
----------------------------------------------------------------------------------------------------------------------
    if 物品.物品编号 == 1500305 then
        if 玩家.背包剩余 >= 4 then
            玩家:消耗背包物品(1, 物品, "使用物品消耗")
            玩家:玩家获得物品(417,1)
            玩家:玩家获得物品(80011,30)
            玩家:玩家获得物品(2315,5)
            if 计算概率(0.5) then
                if 计算概率(0.2) then
                    玩家:玩家获得物品(2315,1)
                else
                    玩家:玩家获得物品(80003,1)
                end
            end
        end
        return 1
    end
----------------------------------------------------------------------------------------------------------------------
-- 使用类物品
----------------------------------------------------------------------------------------------------------------------


    if 物品.物品编号 == 111114 then --神圣石
        local 武器 = 玩家.角色装备[0]
        if 武器 ~= nil and 武器.神圣伤害.V < 武器.装备模板.神圣次数 then
            if 计算概率(0.05) then
                武器.神圣伤害.V = 武器.神圣伤害.V + 1
                --玩家:发送顶部公告("<#T:MMOGame.HolyDmg.UpdateResult>")
                玩家:发送系统消息("<#T:MMOGame.HolyDmg.UpdateResult>")
            else
                武器.圣石数量.V = 武器.圣石数量.V + 1
                --玩家:发送顶部公告("<#T:MMOGame.HolyDmg.UpdateResult0>")
                玩家:发送系统消息("<#T:MMOGame.HolyDmg.UpdateResult0>")
            end
            玩家:消耗背包物品(1, 物品, "使用物品消耗")
            玩家.战力加成[玩家.角色装备[0]] = 玩家.角色装备[0].装备战力
            玩家.属性加成[玩家.角色装备[0]] = 玩家.角色装备[0].装备属性
            玩家:更新对象属性()
            玩家:更新玩家战力()
            玩家:更新物品详情(武器)
        else
            玩家:发送错误消息(1944)
        end
        return 1
    end

    if 物品.物品编号 == 1500706 or 物品.物品编号 == 1510706 or 物品.物品编号 == 1500710 then --破袭者宝箱
        local 破袭者宝箱祖玛表 = {99920017, 99920018, 99920019, 99920045, 99920074, 99920084, 99930019, 99930020, 99930021, 99930049, 99930075, 99930085, 99940010, 99940012, 99940016, 99940021, 99940038, 99940073, 99940083}
        local 破袭者宝箱赤月表 = {99920027, 99920028, 99920029, 99920046, 99920075, 99920085, 99930033, 99930034, 99930035, 99930050, 99930076, 99930086, 99940024, 99940025, 99940026, 99940039, 99940074, 99940084, 99990611, 99990621, 99990631, 99990641, 99990651, 99990661}
        if 玩家.背包剩余 >= 1 then
            玩家:消耗背包物品(1, 物品, "使用物品消耗")
            玩家.金币数量 = 玩家.金币数量 + 200000
            if 计算概率(0.02) then
                local 给与物品 = 玩家:玩家获得物品(从表随机取值(破袭者宝箱赤月表),1)
                给与物品.当前持久.V = 给与物品.最大持久.V
                玩家:更新物品详情(给与物品)
            else
                local 给与物品 = 玩家:玩家获得物品(从表随机取值(破袭者宝箱祖玛表),1)
                给与物品.当前持久.V = 给与物品.最大持久.V
                玩家:更新物品详情(给与物品)
            end
        else
            玩家:发送顶部公告("背包剩余格数不足[2]格，无法打开礼包。",false,false)
            玩家:发送系统消息("背包剩余格数不足[2]格，无法打开礼包。")
        end
        return 1
    end

----------------------------------------------------------------------------------------------------------------------
    local 传永宝典 = {

        [1500507] = {80003,1},--祝福油
        [1500508] = {99990315,1},--兽皮腰带
        [1500509] = {99990317,1},--靴子
        [1500510] = {传永宝典职业沃玛戒指(玩家), 1},
        [1500511] = {传永宝典职业命运武器(玩家), 1},

        [1500551] = {91125,1},
        [1500552] = {91125,3},
        [1500553] = {2201,1},--2201
        [1500554] = {91125,5},--修为丹
        [1500555] = {1},--修为丹
        [1500556] = {2},--修为丹
        [1500557] = {80003,1},--祝福油
        [1500558] = {99990315,1},--兽皮腰带
        [1500559] = {99990317,1},--靴子
        [1500560] = {传永宝典职业沃玛戒指(玩家), 1},


        [1500521] = {1501120,1}, --高级修为丹
        [1500522] = {91189,1}, --精进修为丹1
        [1500523] = {106},
        [1500524] = {91184,1}, --精进修为丹1
        [1500525] = {2}, --精进修为丹1
        [1500526] = {99990315,1},--兽皮腰带
        [1500527] = {99990317,1},--靴子
        [1500528] = {80003,2},--祝福油
        [1500529] = {传永宝典职业沃玛戒指(玩家), 1},
        [1500530] = {91211, 1},
        [1500531] = {传永宝典职业命运武器(玩家), 1},
        [1500532] = {91211, 2},
    }

    if 传永宝典[物品.物品编号] ~= nil then
        if 玩家.背包剩余 >= 2 then
            玩家:消耗背包物品(1, 物品, "使用物品消耗")
            玩家:玩家获得物品(物品.物品编号 + 1, 1)
            if 物品.物品编号 == 1500503 or 物品.物品编号 == 1500523 then
                玩家:玩家获得称号(传永宝典[物品.物品编号][1])
            elseif 物品.物品编号 == 1500505 or 物品.物品编号 == 1500506 or 物品.物品编号 == 1500555 or 物品.物品编号 == 1500556 or 物品.物品编号 == 1500525 then
                玩家:玩家获得物品(获取职业铭文石(玩家), 传永宝典[物品.物品编号][1])
            elseif 物品.物品编号 == 1500508 or 物品.物品编号 == 1500509 or 物品.物品编号 == 1500510 or 物品.物品编号 == 1500511 or 物品.物品编号 == 1500526 or 物品.物品编号 == 1500527 or 物品.物品编号 == 1500529 or 物品.物品编号 == 1500531 or 物品.物品编号 == 1500558 or 物品.物品编号 == 1500559 or 物品.物品编号 == 1500560 then
                local 给与物品 = 玩家:玩家获得物品(传永宝典[物品.物品编号][1], 传永宝典[物品.物品编号][2])
                给与物品.当前持久.V = 给与物品.最大持久.V
                玩家:更新物品详情(给与物品)
            else
                玩家:玩家获得物品(传永宝典[物品.物品编号][1], 传永宝典[物品.物品编号][2])
            end
        else
            玩家:发送系统消息("<font color='#00ff00'><u>背包格数不足[2]格，无法打开礼包。</u></font>")
            玩家:发送顶部公告("<font color='#00ff00'><u>背包格数不足[2]格，无法打开礼包。</u></font>",false,false)
        end
    end
-----------------------------------------------------------------------------------------------------------------------------------------------------
    if 物品.物品编号 == 2306 then
        local 技能书随机表 = {
            {31031, 1.0}, --基本剑术
            {31032, 0.5}, --攻杀剑术
            {31033, 0.1}, --刺杀剑术
            {32531, 1.0}, --火球术
            {32532, 0.7}, --抗拒火环
            {32541, 0.6}, --诱惑之光
            {32544, 0.5}, --地狱火
            {32533, 0.4}, --雷电术
            {32549, 0.3}, --大火球
            {32538, 0.3}, --瞬息移动
            {32545, 0.2}, --爆裂火焰
            {32534, 0.1}, --火墙
            {33002, 1.0}, --治愈术
            {33001, 0.8}, --精神力战法
            {33004, 0.7}, --施毒术
            {33005, 0.6}, --灵魂火符
            {33003, 0.5}, --召唤骷髅
            {33009, 0.4}, --隐身术
            {33014, 0.3}, --集体隐身术
            {33006, 0.2}, --幽灵盾
            {33007, 0.1}, --神圣战甲术
            {34001, 1.0}, --暴击术
            {34004, 0.8}, --精准术
            {34011, 0.7}, --霹雳弹
            {34002, 0.6}, --潜行术
            {34003, 0.3}, --致残毒药
            {35001, 1.0}, --基础射击
            {35002, 0.7}, --精准打击
            {35003, 0.6}, --二连射
            {35004, 0.5}, --战术标记
            {35005, 0.3}, --三发散射
            {36001, 1.0}, --中平枪术
            {36002, 0.7}, --伏波荡寇
            {36003, 0.6}, --横扫六合
            {36004, 0.4}, --狂飙突刺
            {31033, 1.0}, --刺杀剑术
            {31034, 0.3}, --半月弯刀
            {31035, 0.2}, --野蛮冲撞
            {31036, 0.0001}, --烈火剑法
            {31037, 0.0006}, --狮子吼
            {31038, 0.0002}, --爆炎剑诀
            {32545, 1.0}, --爆裂火焰
            {32534, 0.5}, --火墙
            {32536, 0.3}, --疾光电影
            {32546, 0.2}, --地狱雷光
            {32535, 0.0005}, --魔法盾
            {32547, 0.4}, --圣言术
            {32537, 0.002}, --冰咆哮
            {32539, 0.0001}, --灭天火
            {32550, 0.0005}, --寒冰掌
            {33006, 1.0}, --幽灵盾
            {33007, 0.6}, --神圣战甲术
            {33011, 0.7}, --困魔咒
            {33012, 0.4}, --群体治愈术
            {33008, 0.0002}, --召唤神兽
            {33018, 0.0009}, --气功波
            {33015, 0.0003}, --无极真气
            {34002, 1.0}, --潜行术
            {34003, 0.6}, --致残毒药
            {34007, 0.7}, --鬼灵步
            {34005, 0.4}, --炎龙波
            {34006, 0.5}, --旋风腿
            {34008, 0.0002}, --冷酷
            {34010, 0.0003}, --追魂镖
            {35004, 1.0}, --战术标记
            {35005, 0.5}, --三发散射
            {35006, 0.4}, --击飞射击
            {35013, 0.3}, --回避射击
            {35007, 0.0002}, --强袭
            {35008, 0.0006}, --连环暗雷
            {35010, 0.0003}, --穿刺射击
            {36004, 1.0}, --狂飙突刺
            {36005, 0.7}, --钩镰枪法
            {36006, 0.4}, --乾坤斗气
            {36007, 0.3}, --神威镇域
            {36008, 0.0001}, --枪出如龙
            {36009, 0.0003}, --御龙晶甲
            {36010, 0.0002}, --凌云枪法
        }
        if 玩家.背包剩余 >= 1 then
            玩家:消耗背包物品(1, 物品, "使用物品消耗")
            玩家:玩家获得物品(从几率表随机取值(技能书随机表),1)
        else
            玩家:发送顶部公告("背包剩余格数不足[2]格，无法打开礼包。",false,false)
            玩家:发送系统消息("背包剩余格数不足[2]格，无法打开礼包。")
        end
        return 1
    end

-----------------------------------------------------------------------------------------------------------------------------------------------------
    if 物品.物品编号 == 31000 then --中级技能书
        if 玩家.背包剩余 >= 1 then
            local 获取职业表 = {
                [1] = {31034, 1},  --战士
                [2] = {32546, 1},  --法师
                [3] = {34005, 1},  --刺客
                [4] = {35006, 1},  --弓手  35006
                [5] = {33012, 1},  --道士  33012
                [6] = {36006, 1},  --龙枪
            }
            玩家:消耗背包物品(1, 物品, "使用物品消耗")
            玩家:玩家获得物品(获取职业表[获取职业数字(玩家)][1],获取职业表[获取职业数字(玩家)][2])
        else
            玩家:发送系统消息("<font color='#00ff00'><u>背包格数不足[1]格，无法打开礼包。</u></font>")
            玩家:发送顶部公告("<font color='#00ff00'><u>背包格数不足[1]格，无法打开礼包。</u></font>",false,false)
        end
        return 1
    end

    if 物品.物品编号 == 1700002 then --各职业残卷礼包
        if 玩家.背包剩余 >= 1 then
            local 获取职业表 = {
                [1] = {90217, 1},
                [2] = {90218, 1},
                [3] = {90219, 1},
                [4] = {90237, 1},
                [5] = {90244, 1},
                [6] = {90248, 1},
            }
            玩家:消耗背包物品(1, 物品, "使用物品消耗")
            玩家:玩家获得物品(获取职业表[获取职业数字(玩家)][1],获取职业表[获取职业数字(玩家)][2])
        else
            玩家:发送系统消息("<font color='#00ff00'><u>背包格数不足[1]格，无法打开礼包。</u></font>")
            玩家:发送顶部公告("<font color='#00ff00'><u>背包格数不足[1]格，无法打开礼包。</u></font>",false,false)
        end
        return 1
    end
-----------------------------------------------------------------------------------------------------------------------------------------------------
    local 增加铭文表 = {
        [3000015] = {1, 50},
        [1700001] = {1, 1}, --数量
        [1500066] = {1, 1},
    }

    if 增加铭文表[物品.物品编号] ~= nil then --各职业铭文礼包
        if 玩家.背包剩余 >= 增加铭文表[物品.物品编号][1] then
            玩家:消耗背包物品(1, 物品, "使用物品消耗")
            玩家:玩家获得物品(获取职业铭文石(玩家),增加铭文表[物品.物品编号][2])
        else
            玩家:发送系统消息("<font color='#00ff00'><u>背包格数不足[".. 增加铭文表[物品.物品编号] .."]格，无法打开礼包。</u></font>")
            玩家:发送顶部公告("<font color='#00ff00'><u>背包格数不足[".. 增加铭文表[物品.物品编号] .."]格，无法打开礼包。</u></font>",false,false)
        end
        return 1
    end

    local 物品所需格数 = {
        [140102] =  {5},
        [1500301] = {5},
        [1500302] = {4},
        [1500303] = {4},
        [1500304] = {4},
        [140101] =  {6},
        [1500038] = {5},
        [1500064] = {10},
        [1500176] = {5},
        [1500177] = {10},
        [1500196] = {3},
        [1500197] = {5},
        [140103] =  {5},
        [140104] =  {4},
        [1000103] = {1},
        [1000104] = {2},
        [1400001] = {4},
        [1400002] = {4},
        [1400003] = {3},
        [1400004] = {4},
        [1400005] = {4},
        [1400006] = {4},
        [1500006] = {5},
        [1500007] = {6},
        [1500013] = {5},
        [1500017] = {5},
        [1500018] = {5},
        [1500019] = {5},
        [1500132] = {3},
        [1500163] = {3},
        [1500174] = {3},
        [1500193] = {7},
        [1500194] = {10},
        [1500207] = {2},
        [1500368] = {2},
        [1500820] = {2},
        [1500847] = {2},
        [1500858] = {4},
        [1500894] = {2},
        [1501150] = {2},
    }

    local 增加多个物品表 = {
        [140102] = {416, 99900042, 80011, 2315, 140001},
        [1500301] = {416, 80011, 398, 408, 91195},
        [1500302] = {416, 99900042, 80011, 2315},
        [1500303] = {417, 99900042, 80011, 2315},
        [1500304] = {417, 99900042, 80011, 2315},
        [140101] = {416, 80011, 398, 408, 91195, 140001},
        [1500038] = {417, 417, 417, 80011, 91184},
        [1500064] = {418, 418, 418, 418, 418, 418, 418, 418, 418, 418},
        [1500176] = {418, 418, 418, 418, 418},
        [1500177] = {418, 418, 418, 418, 418, 418, 418, 418, 418, 418},
        [1500196] = {417, 417, 417},
        [1500197] = {417, 417, 417, 417, 417},
        [140103] = {417, 99900042, 80011, 2315, 140001}, -- 强效太阳水包 点金锄 强效战神油 练功券 碎裂的无相石
        [140104] = {417, 99900042, 80011, 2315},
        [1000103] = {10120,10220,10520},
        [1000104] = {91211,1600016},
        [1400001] = {31036, 31037, 31038, 31042},
        [1400002] = {32535, 32537, 32550, 32539},
        [1400003] = {33008, 33015, 33010},
        [1400004] = {34008, 34006, 34007, 34009},
        [1400005] = {35007, 35008, 35010, 35011},
        [1400006] = {36008, 36009, 36010, 36011},
        [1500006] = {416,416,416,416,416}, -- 太阳水包
        [1500007] = {417, 417, 417, 418, 418, 418}, --强效太阳水包 疗伤药包
        [1500013] = {114026,114026,114026,114026,114026},
        [1500017] = {398, 398, 398, 398, 398,}, --超级金创药
        [1500018] = {408, 408, 408, 408, 408}, --超级魔法药
        [1500019] = {418, 418, 418, 418, 418}, --疗伤药包
        [1500132] = {34008, 34007, 34003}, --冷酷, 鬼灵步, 致残毒药
        [1500163] = {35007, 35008, 35006}, --强袭, 连环暗雷, 击飞射击
        [1500174] = {36008, 36005, 36007}, --枪出如龙  钩链枪法 神威镇域
        [1500193] = {1500195, 417, 417, 417, 80203, 91102, 91184}, --庆典蛋糕 强效太阳水包 幽冥海入场卷 冥想丹  绑定- -
        [1500194] = {1500195, 417, 417, 417, 417, 417,获取职业铭文石(玩家),91102,80201,80202},
        [1500207] = {99900041,99900040},
        [1500368] = {418, 418}, --疗伤药
        [1500820] = {获取职业铭文石(玩家), 91184},
        [1500847] = {91211,90501}, --如意丹, 龙卫残卷
        [1500858] = {417,91125,80201,80202}, --媒体特权礼包1 强效太阳水 -修为丹- 盟重回城石 比奇回城石
        [1500894] = {获取职业铭文石(玩家), 91184}, -- 铭文石 冥想丹
        [1501150] = {91211, 140002}, --如意丹 完整的无相石
        [1503008] = {398,398,398,408,408,408,417,417,417}, --新手上路礼包
    }

    local 增加多个数量表 = {
        [140102] = {1, 1, 10, 2, 30},
        [1500301] = {1, 5, 1, 1, 1},
        [1500302] = {1, 1, 10, 1},
        [1500303] = {1, 1, 15, 2},
        [1500304] = {1, 1, 15, 2},
        [140101] = {1, 5, 1, 1, 1, 30},
        [1500038] = {1, 1 , 1, 5, 1},
        [1500064] = {6, 6, 6, 6, 6, 6, 6, 6, 6, 6},
        [1500176] = {6, 6, 6, 6, 6},
        [1500177] = {6, 6, 6, 6, 6, 6, 6, 6, 6, 6},
        [1500196] = {6, 6, 6},
        [1500197] = {6, 6, 6, 6, 6},
        [140103] = {1, 1, 15, 2, 30},
        [140104] = {1, 1, 20, 5},
        [1000103] = {1,1,1},
        [1000104] = {5,1},
        [1400001] = {1,1,1,1},
        [1400002] = {1,1,1,1},
        [1400003] = {1,1,1},
        [1400004] = {1,1,1,1},
        [1400005] = {1,1,1,1},
        [1400006] = {1,1,1,1},
        [1500006] = {1,1,1,1,1},
        [1500007] = {1,1,1,1,1,1},
        [1500013] = {1,1,1,1,1,1},
        [1500017] = {1,1,1,1,1},
        [1500018] = {1,1,1,1,1},
        [1500019] = {1,1,1,1,1},
        [1500132] = {1,1,1},
        [1500163] = {1,1,1},
        [1500174] = {1,1,1},
        [1500193] = {5,1,1,1,1,1,1},
        [1500194] = {5,1,1,1,1,1,2,1,1,1},
        [1500207] = {1, 1},
        [1500368] = {1, 1},
        [1500820] = {10,2},
        [1500847] = {1, 2},
        [1500858] = {1,1,1,1},
        [1500894] = {16,2},
        [1501150] = {1,20},
    }

    local 增加经验表 = {
        [91125] = {10000}, --修为丹
        [1501120] = {50000}, -- 高级修为丹
        [1501121] = {100000}, -- 特级修为丹
        [1501152] = {666666}, -- 庆典修为丹
        [1370001] = {3300},  --龙卫之乡经验包
        [1370002] = {33000},  --巨木之森经验包
        [1370003] = {66000},  --英雄土城经验包
        [1370004] = {99000},  --昔日龙脉经验包
        [1370005] = {132000},  --沃玛珍宝经验包
        [1370006] = {165000},  --毒虫迷宫经验包
        [1370007] = {198000},  --猪妖秘宝经验包
        [1370008] = {231000},  --祖玛旧梦经验包
        [1370012] = {300000}, --白日围城经验包
        [1370009] = {450000},  --赤月恶魔经验包
        [1370010] = {600000}, --魔龙谷经验包
        [1370014] = {750000}, --赤月群岛经验包
        [1370011] = {900000}, --苍月岛经验包
        [1370013] = {1050000}, --踏雪屠龙经验包
        [91189] = {200000}, -- 精进修为丹
        [2360] = {900000}, -- 魔龙幻境找回礼盒1
        [2361] = {900000}, -- 魔龙幻境找回礼盒1
        [2362] = {1200000}, -- 魔龙幻境找回礼盒1
        [2316] = {250000}, --妖塔经验找回
        [2317] = {1000000}, -- 魔塔找回礼盒1
        [2318] = {1000000}, -- 魔塔找回礼盒1
        [2320] = {300000},
        [2321] = {100000},
        [2322] = {400000},
        [2323] = {500000},
        [2324] = {180000},
        [2325] = {250000},
        [2327] = {350000},
        [2331] = {50000},
        [2332] = {350000},
        [2333] = {50000},
        [2334] = {80000},
        [2335] = {150000},
        [2336] = {1200000},
        [2337] = {350000},
        [2338] = {450000},
        [2350] = {600000},
        [1500926] = {10000}, -- 勇者金币礼包(小)
        [1500927] = {20000}, -- 勇者金币礼包(中)
        [1500928] = {50000}, -- 勇者金币礼包(大)

        [94060] = {100000},
        [94061] = {200000},
        [94062] = {300000},
    
        [94063] = {100000},
        [94064] = {200000},
        [94065] = {300000},
    
        [94066] = {100000},
        [94067] = {200000},
        [94068] = {300000},
    }

    local 增加银币表 = {  --玛法传说银币表
        [1370201] = {15000}, --龙卫之乡银币包
        [1370202] = {30000}, --巨木之森银币包
        [1370203] = {45000}, --英雄土城银币包
        [1370204] = {60000}, --昔日龙脉银币包
        [1370205] = {75000}, --沃玛珍宝银币包
        [1370206] = {90000}, --毒虫迷宫银币包
        [1370207] = {105000}, --猪妖秘宝银币包
        [1370208] = {120000}, --祖玛旧梦银币包
        [1370209] = {10000}, --银币礼包10000
        [1370210] = {20000}, --银币礼包20000
        [1370211] = {50000}, --银币礼包50000
        [1370212] = {100000}, --银币礼包100000
        [1370213] = {500000}, --银币礼包500000
        [1370214] = {1000000}, --银币礼包1000000
        [1370215] = {150000},  --银币礼包150000
        [1500892] = {150000},  --至尊银币礼包
        [1502033] = {500000},  --银币加油包
        [2316] = {30000}, --妖塔经验找回
        [2337] = {30000}, --妖塔经验找回
        [2338] = {30000}, --妖塔经验找回
        [1500194] = {10000},
        [1500858] = {50000}, --媒体特权礼包1
    }

    local 增加金币表 = {  --玛法传说金币表
        [1370112] = {135000}, --白日围城金币包
        [1370109] = {165000}, --赤月恶魔金币包
        [1370110] = {220000}, --魔龙谷金币包
        [1370114] = {275000}, --赤月群岛金币包
        [1370111] = {330000}, --苍月岛金币包
        [1370113] = {385000}, --踏雪屠龙金币包
        -- [1510096] = {50000000}, --蛋糕
        -- [1410093] = {5000000}, --玛法功臣礼包
        [1500039] = {880000}, --财源滚滚礼包
        [1500058] = {1880000}, --感恩传永礼包
    }

    local 增加称号表 = {
        [1410094] = {94}, --称号
        [1410103] = {139}, --征战玛法礼包
        [1410096] = {96}, --擂台小将
        [1410097] = {97}, --擂台霸主
        [1410093] = {93}, --玛法功臣
        [1410095] = {95}, --17173
        [1410122] = {128}, --武道圣心
        [1410123] = {129}, --武道至尊
        [1410124] = {133}, --周年庆
        [1503008] = {14}, -- 新手上路礼包
        [1501061] = {136},
    }

    local 普通物品礼包表 = {
        [1501220] = {91115, 11, false},    --打孔石限定福袋
        [1501221] = {91116, 11, false},    --雕色石限定福袋
        [1501222] = {91115, 23, false},    --打孔石限定锦盒
        [1501223] = {91116, 23, false},    --雕色石限定锦盒
        [1501211] = {41002, 10, false},    --精炼石福袋
        [1501212] = {41001, 10, false},    --精炼精华福袋
        [1501062] = {110006, 40, false},   --圣战装备精粹宝匣
        [1501063] = {110007, 40, false},   --法神装备精粹宝匣
        [1501064] = {110008, 40, false},   --天尊装备精粹宝匣
        [1501065] = {110009, 40, false},   --影刺装备精粹宝匣
        [1501066] = {110010, 40, false},   --弓手装备精粹宝匣
        [1501067] = {110013, 40, false},   --龙枪装备精粹宝匣
        [1501051] = {80003, 10, false},    --祝福油锦盒1
        [1501140] = {111114, 10, false},   --神圣石锦盒1
        [1501058] = {91117, 10, false},    --幸运符锦盒1
        [1501052] = {111105, 10, false},   --战士铸魂锦盒1
        [1501053] = {111106, 10, false},   --法师铸魂锦盒1
        [1501054] = {111107, 10, false},   --道士铸魂锦盒1
        [1501055] = {111108, 10, false},   --刺客铸魂锦盒1
        [1501056] = {111116, 10, false},   --弓手铸魂锦盒1
        [1501057] = {111306, 10, false},   --龙枪铸魂锦盒1
        [1501068] = {110011, 1000, false}, --特级装备碎片宝匣
        [1501201] = {140002, 100, false},  --完整的无相石福袋
        [1501169] = {140003, 100, false},  --无瑕的无相石福袋
        [1500082] = {21001, 10, false},    --铭文礼包(战)
        [1510079] = {21001, 100, false},   --铭文大礼包(战)
        [1500083] = {21002, 10, false},    --铭文礼包(法)
        [1500080] = {21002, 100, false},   --铭文大礼包(法)
        [1500084] = {21003, 10, false},    --铭文礼包(道)
        [1500081] = {21003, 100, false},   --铭文大礼包(道)
        [1500148] = {21004, 10, false},    --铭文礼包(刺)
        [1500147] = {21004, 100, false},   --铭文大礼包(刺)
        [1500156] = {21005, 10, false},    --铭文礼包(弓)
        [1500155] = {21005, 100, false},   --铭文大礼包(弓)
        [1500167] = {21006, 10, false},    --铭文礼包(枪)
        [1500166] = {21006, 100, false},   --铭文大礼包(枪)
        [1501032] = {111105, 10, false},   --战士铸魂锦盒
        [1501077] = {111105, 10, false},   --战士铸魂锦盒2
        [1501033] = {111106, 10, false},   --法师铸魂锦盒
        [1501078] = {111106, 10, false},   --法师铸魂锦盒2
        [1501034] = {111107, 10, false},   --道士铸魂锦盒
        [1501079] = {111107, 10, false},   --道士铸魂锦盒2
        [1501035] = {111107, 10, false},   --刺客铸魂锦盒
        [1501080] = {111108, 10, false},   --刺客铸魂锦盒2
        [1501036] = {111116, 10, false},   --弓手铸魂锦盒
        [1501081] = {111116, 10, false},   --弓手铸魂锦盒2
        [1501040] = {111306, 10, false},   --龙枪铸魂锦盒
        [1501082] = {111306, 10, false},   --龙枪铸魂锦盒2
        [1501226] = {91115, 23, false},    -- 打孔石限定锦盒1 绑定
        [1501227] = {91116, 23, false},    -- 雕色石限定锦盒1
        [1500069] = {传永宝典职业命运武器(玩家), 1, true},
        [1500072] = {21001, 10, false},
        [1500073] = {21002, 10, false},
        [1500074] = {21003, 10, false},
        [1500076] = {80003, 10, false},
        [1500087] = {21001, 1, false},
        [1500099] = {80011, 10, false},
        [1500138] = {111058, 10, false},
        [1500139] = {111059, 10, false},
        [1500140] = {111060, 10, false},
        [1500141] = {111078, 10, false},
        [1500145] = {21004, 1, false},
        [1500146] = {21004, 11, false},
        [1500149] = {10620, 11, false},
        [1500153] = {21005, 1, false},
        [1500154] = {21005, 11, false},
        [1500161] = {111091, 10, false},
        [1500164] = {21006, 1, false},
        [1500165] = {21006, 11, false},
        [1500175] = {获取职业铭文石(玩家), 5, true},
        [1500880] = {111058, 5, false},
        [1500881] = {111059, 5, false},
        [1500882] = {111060, 5, false},
        [1500883] = {111078, 5, false},
        [1500884] = {111091, 5, false},
        [1500885] = {111301, 5, false},
        [1501141] = {111114, 10, false},
        [1501210] = {140002, 50, false},
        [1501173] = {91117, 5, false}, --幸运符
        [1501171] = {41002, 5, false}, --精炼石
        [1501170] = {140003, 50, false}, --无瑕的无相石
        [1501224] = {91115, 23, false},
        [1501225] = {91116, 23, false},
        [2318] = {90501, 2, false},
        [2321] = {90501, 1, false},
        [2322] = {91127, 12, false},
        [2323] = {91127, 24, false},
        [2333] = {91184, 1, false},
        [2334] = {91184, 2, false},
        [2335] = {91184, 2, false},
        [2350] = {91127, 24, false},
        [140007] = {140005, 5, false},
        [140008] = {140002, 30, false},
        [1500008] = {397,1, false},
        [1500010] = {416,1, false},
        [1500011] = {灵石礼包本职业灵石(玩家), 1, true},
        [1500012] = {获取职业铭文石(玩家), 5, true},
        [1500020] = {80003, 3, true},
        [1500040] = {69900008, 1, true},
        [1500041] = {69900009, 1, true},
        [1500058] = {91125, 188, true}, --修为丹
        [1500172] = {111301, 10, false}, --龙枪武器精粹
        [1500185] = {95051 + 玩家.角色数据.传奇之力等级, 1, true},
        [1500191] = {91211, 1, true}, -- 如意丹
        [1500192] = {91211, 2, true}, -- 如意丹
        [1500202] = {397, 1, true}, -- 金疮药中包绑定
        [1500209] = {397, 1, true}, -- 金疮药中包绑定
        [1500212] = {397, 1, true}, -- 金疮药中包绑定
        [1500214] = {397, 1, true}, -- 金疮药中包绑定
        [1500215] = {397, 1, true}, -- 金疮药中包绑定
        [1500216] = {397, 1, true}, -- 金疮药中包绑定
        [1500217] = {397, 1, true}, -- 金疮药中包绑定
        [1500218] = {397, 1, true}, -- 金疮药中包绑定
        [1500219] = {397, 1, true}, -- 金疮药中包绑定
        [1500220] = {397, 1, true}, -- 金疮药中包绑定
        [1500221] = {397, 1, true}, -- 金疮药中包绑定
        [1500222] = {获取职业铭文石(玩家), 1, true}, -- 铭文礼包22
        [1500223] = {397, 1, true}, -- 金疮药中包绑定
        [1500225] = {397, 1, true}, -- 金疮药中包绑定
        [1500226] = {397, 1, true}, -- 金疮药中包绑定
        [1500227] = {397, 1, true}, -- 金疮药中包绑定
        [1500228] = {397, 1, true}, -- 金疮药中包绑定
        [1500237] = {99900042, 1, true}, --点击锄
        [1500369] = {获取职业铭文石(玩家), 6, true}, --名俊铭文石礼包
        [1500370] = {获取职业武器精粹(玩家), 5,true}, --名俊武器精粹礼包
        [1500351] = {111003, 5, true},
        [1500930] = {获取职业铭文石(玩家), 3, true}, -- 铭文礼包3
        [1501087] = {21001,100,false}, --铭文大礼包(战)1
        [1501088] = {21002,100,false}, --法
        [1501089] = {21003,100,false}, --道
        [1501090] = {21004,100,false}, --刺
        [1501091] = {21005,100,false}, --弓
        [1501092] = {21006,100,false}, --枪
        [1501093] = {21001,10,false}, --铭文礼包(战)1
        [1501094] = {21002,10,false}, --法
        [1501095] = {21003,10,false}, --道
        [1501096] = {21004,10,false}, --刺
        [1501097] = {21005,10,false}, --弓
        [1501098] = {21006,10,false}, --枪
        [1502037] = {获取职业铭文石(玩家),1,true},
        [94060] = {91184, 1, true},
        [94061] = {91184, 1, true},
        [94062] = {91184, 1, true},
        [94063] = {91184, 2, true},
        [94064] = {91184, 2, true},
        [94065] = {91184, 2, true},
        [94066] = {91184, 3, true},
        [94067] = {91184, 3, true},
        [94068] = {91184, 3, true},
        [1500896] = {91184, 2, true},
        [1501014] = {80003, 10, true},--1501103
        [1501028] = {111116,10, true},
        [1501018] = {111108,10, true},
        [1501017] = {111107,10, true},
        [1501016] = {111106,10, true},
        [1501015] = {111105,10, true},
    }

    local 普通附加物品表 = {
        [1501220] = {1501086, 200, true},    --打孔石限定福袋
        [1501221] = {1501086, 200, true},    --雕色石限定福袋
        [1501222] = {1501086, 400, true},    --打孔石限定锦盒
        [1501223] = {1501086, 400, true},    --雕色石限定锦盒
        [1501211] = {1501086, 10, true},    --精炼石福袋
        [1501212] = {1501086, 20, true},    --精炼精华福袋
        [1501062] = {1501086, 160, true},   --圣战装备精粹宝匣
        [1501063] = {1501086, 160, true},   --法神装备精粹宝匣
        [1501064] = {1501086, 160, true},   --天尊装备精粹宝匣
        [1501065] = {1501086, 160, true},   --影刺装备精粹宝匣
        [1501066] = {1501086, 160, true},   --弓手装备精粹宝匣
        [1501067] = {1501086, 160, true},   --龙枪装备精粹宝匣
        [1501051] = {1501086, 20, true},    --祝福油锦盒1
        [1501140] = {1501086, 60, true},    --神圣石锦盒1
        [1501058] = {1501086, 100, true},    --幸运符锦盒1
        [1501052] = {1501086, 36, true},   --战士铸魂锦盒1
        [1501053] = {1501086, 36, true},   --法师铸魂锦盒1
        [1501054] = {1501086, 36, true},   --道士铸魂锦盒1
        [1501055] = {1501086, 36, true},   --刺客铸魂锦盒1
        [1501056] = {1501086, 36, true},   --弓手铸魂锦盒1
        [1501057] = {1501086, 36, true},   --龙枪铸魂锦盒1
        [1501068] = {1501086, 160, true}, --特级装备碎片宝匣
        [1501201] = {1501086, 50, true},  --完整的无相石福袋
        [1501169] = {1501086, 180, true},  --无瑕的无相石福袋
        [1500082] = {1501086, 12, true},    --铭文礼包(战)
        [1510079] = {1501086, 120, true},   --铭文大礼包(战)
        [1500083] = {1501086, 8, true},    --铭文礼包(法)
        [1500080] = {1501086, 80, true},   --铭文大礼包(法)
        [1500084] = {1501086, 8, true},    --铭文礼包(道)
        [1500081] = {1501086, 80, true},   --铭文大礼包(道)
        [1500148] = {1501086, 12, true},    --铭文礼包(刺)
        [1500147] = {1501086, 120, true},   --铭文大礼包(刺)
        [1500156] = {1501086, 8, true},    --铭文礼包(弓)
        [1500155] = {1501086, 80, true},   --铭文大礼包(弓)
        [1500167] = {1501086, 12, true},    --铭文礼包(枪)
        [1500166] = {1501086, 120, true},   --铭文大礼包(枪)
        [1501014] = {1501103, 6, true},--1501103
        [1501028] = {1501103,20, true},
        [1501018] = {1501103,20, true},
        [1501017] = {1501103,20, true},
        [1501016] = {1501103,20, true},
        [1501015] = {1501103,20, true},
    }

    local 装备物品随机表 = {
        [1500897] = {99920017, 99920018, 99920019, 99920045, 99920074, 99920084, 99930019, 99930020, 99930021, 99930049, 99930075, 99930085, 99940010, 99940012, 99940016, 99940021, 99940038, 99940073, 99940083},--至尊装备宝盒
        [1700007] = {99920017, 99920018, 99920019, 99920045, 99920074, 99920084, 99930019, 99930020, 99930021, 99930049, 99930075, 99930085, 99940010, 99940012, 99940016, 99940021, 99940038, 99940073, 99940083},-- 祖玛档首饰
        [1700006] = {99980513, 99990513, 99980523, 99990523, 99980533, 99990533, 99980543, 99990543, 99980553, 99990553, 99980563, 99990563}, --祖玛衣服
        [1700005] = {99900022, 99900023, 99900024, 99900055, 99900076, 99900105}, --祖玛武器
        [1500056] = {99920016, 99920020, 99920021, 99920044, 99920073, 99930018, 99930017, 99930014, 99930048, 99930074, 99940020, 99940011, 99940015, 99940037, 99940072}, -- 沃玛首饰
    }

    local 普通物品随机表 = {
        [2301] = {5, 418, 80003, 202006, 2306, 2305}, -- 狩猎礼包
        [2305] = {6, 21001, 21002, 21003, 21004, 21005, 21006}, --随机铭文石
        [1700020] = {6, 21001, 21002, 21003, 21004, 21005, 21006}, --随机铭文石1
        [1500205] = {8, 701, 702, 703, 704, 705, 706, 707, 708},--神秘礼包5
        [1500915] = {5, 90501, 80003, 140002, 91211, 111114}, --酬勤礼包
        [1500862] = {5,90501,80003,2315,91211,111114},
        [1500352] = {18,111011,111012,111013,111014,111015,111016,111017,111018,111019,111082,111083,111084,111117,111118,111119,111307,111308,111309},
        [1500863] = {5,80003,91211,2315,90505,获取职业铭文石(玩家)},
                --           随机数值    疗伤药 职业铭文 -  111061 - 111064(勋章材料) 100001(镇魔秘药) 90505-宝珠  90507-宝玉
        [1500800] = {14, 413, 21001, 21002, 21003, 21004, 21005, 21006, 111061, 111062, 111063, 111064, 100001, 90505, 90507}, --镇魔重宝(秘境)
        [1500832] = {12, 413, 21001, 21002, 21003, 21004, 21005, 21006, 111061, 111062, 111063, 111064, 100001},
        [1500831] = {12, 413, 21001, 21002, 21003, 21004, 21005, 21006, 111061, 111062, 111063, 111064, 100001},
        [1500830] = {8, 413, 21001, 21002, 21003, 21004, 21005, 21006, 100001},
        [1500896] = {6, 10420, 10320, 10110, 10620, 10720, 10820},
    }

    local 普通物品数量表 = {
        [90501] = {10},
        [80003] = {5},
        [140002] = {50},
        [91211] = {1},
        [111114] = {1},
        [2315] = {20},
        [10420] = {randomNum(1,2,false)},
        [10320] = {randomNum(1,2,false)},
        [10110] = {randomNum(1,2,false)},
        [10620] = {randomNum(1,2,false)},
        [10720] = {randomNum(1,2,false)},
        [10820] = {randomNum(1,2,false)},
    }

    local 游戏货币表 = {
        [1500926] = {2},
        [1500927] = {4},
        [1500928] = {10},
    }
    
    local 概率获得物品表 = {
        [94061] = {0.3, 9, 21001, 21002, 21003, 21004, 21005, 21006, 111061, 111062},
        [94062] = {0.3, 9, 21001, 21002, 21003, 21004, 21005, 21006, 111061, 111062},

        [94064] = {0.3, 9, 21001, 21002, 21003, 21004, 21005, 21006, 111061, 111062},
        [94065] = {0.3, 9, 21001, 21002, 21003, 21004, 21005, 21006, 111061, 111062},

        [94067] = {0.3, 9, 21001, 21002, 21003, 21004, 21005, 21006, 111061, 111062},
        [94068] = {0.3, 9, 21001, 21002, 21003, 21004, 21005, 21006, 111061, 111062},
    }

    local 增加双倍经验表 = {
        [1700029] = {500000},
    }

    local 使用成功 = false
---------------------------随机表----------------------------------------------------------------
    if 增加双倍经验表[物品.物品编号] ~= nil then
        玩家.双倍经验 = 玩家.双倍经验 + 增加双倍经验表[物品.物品编号][1]
        使用成功 = true
    end

    if 普通物品随机表[物品.物品编号] ~= nil then
        if 玩家.背包剩余 >= 2 then
            local 给与物品 = 普通物品随机表[物品.物品编号][randomNum(2, 普通物品随机表[物品.物品编号][1], false)]
            if 普通物品数量表[给与物品] ~= nil then
                玩家:玩家获得物品(给与物品, 普通物品数量表[给与物品][1])
            else
                玩家:玩家获得物品(给与物品, 1)
            end
            使用成功 = true
        else
            玩家:发送顶部公告("背包剩余格数不足[2]格，无法打开礼包。",false,false)
            玩家:发送系统消息("背包剩余格数不足[2]格，无法打开礼包。")
        end
    end

    if 装备物品随机表[物品.物品编号] ~= nil then
        if 玩家.背包剩余 >= 1 then
            local 给与物品 = 玩家:玩家获得物品(从表随机取值(装备物品随机表[物品.物品编号]), 1)
            给与物品.当前持久.V = 给与物品.最大持久.V
            玩家:更新物品详情(给与物品)
            使用成功 = true
        else
            玩家:发送顶部公告("背包剩余格数不足[1]格，无法打开礼包。",false,false)
            玩家:发送系统消息("背包剩余格数不足[1]格，无法打开礼包。")
        end
    end

    if 增加多个物品表[物品.物品编号] ~= nil then
        if 玩家.背包剩余 > 物品所需格数[物品.物品编号][1] then
            for key, V in ipairs(增加多个物品表[物品.物品编号]) do
                if  V == 99900041 or V == 99900040 or V == 99900042 then
                    local 给与物品 = 玩家:玩家获得物品(V, 增加多个数量表[物品.物品编号][key], "礼包给与", true)
                    给与物品.当前持久.V = 给与物品.最大持久.V
                    玩家:更新物品详情(给与物品)
                else
                    玩家:玩家获得物品(V, 增加多个数量表[物品.物品编号][key], "礼包给与", true)
                end
            end
            使用成功 = true
        else
            玩家:发送顶部公告("背包剩余格数不足[".. 物品所需格数[物品.物品编号][1] .."]格，无法打开礼包。",false,false)
            玩家:发送系统消息("背包剩余格数不足[".. 物品所需格数[物品.物品编号][1] .."]格，无法打开礼包。")
        end
    end

    if 增加金币表[物品.物品编号] ~= nil then
        玩家.金币数量 = 玩家.金币数量 + 增加金币表[物品.物品编号][1]
        使用成功 = true
    end
    if 增加银币表[物品.物品编号] ~= nil then
        玩家.银币数量 = 玩家.银币数量 + 增加银币表[物品.物品编号][1]
        使用成功 = true
    end
    if 增加称号表[物品.物品编号] ~= nil then
        玩家:玩家获得称号(增加称号表[物品.物品编号][1])
        使用成功 = true
    end
    if 增加经验表[物品.物品编号] ~= nil then
        玩家:玩家增加经验(nil, 增加经验表[物品.物品编号][1])
        使用成功 = true
    end
    if 游戏货币表[物品.物品编号] ~= nil then
        玩家:玩家获得货币(游戏货币.勇者金币, 游戏货币表[物品.物品编号][1])
    end

    if 普通物品礼包表[物品.物品编号] ~= nil then
        if 玩家.背包剩余 >= 2 then
            if 物品.物品编号 == 1500069 or 物品.物品编号 == 1500040 or 物品.物品编号 == 1500041 or 物品.物品编号 == 1500237 then
                local 给与物品 = 玩家:玩家获得物品(普通物品礼包表[物品.物品编号][1], 普通物品礼包表[物品.物品编号][2], "礼包获得", 普通物品礼包表[物品.物品编号][3])
                给与物品.当前持久.V = 给与物品.最大持久.V
                玩家:更新物品详情(给与物品)
                使用成功 = true
            else
                玩家:玩家获得物品(普通物品礼包表[物品.物品编号][1], 普通物品礼包表[物品.物品编号][2], "礼包获得", 普通物品礼包表[物品.物品编号][3])
                使用成功 = true
            end
        else
            玩家:发送顶部公告("背包剩余格数不足[2]格，无法打开礼包。",false,false)
            玩家:发送系统消息("背包剩余格数不足[2]格，无法打开礼包。")
        end
    end

    if 普通附加物品表[物品.物品编号] ~= nil then
        玩家:玩家获得物品(普通附加物品表[物品.物品编号][1], 普通附加物品表[物品.物品编号][2], "礼包", 普通附加物品表[物品.物品编号][3])
        使用成功 = true
    end

    if 概率获得物品表[物品.物品编号] ~= nil then
        if 玩家.背包剩余 >= 1 then
            if 计算概率(概率获得物品表[物品.物品编号][1]) then
                -- 玩家:发送系统消息("".. randomNum(3, 概率获得物品表[物品.物品编号][2], false) .."")
                local 给与物品 = 概率获得物品表[物品.物品编号][randomNum(3, 概率获得物品表[物品.物品编号][2], false)]
                玩家:玩家获得物品(给与物品, 1)
            end
        else
            玩家:发送顶部公告("背包剩余格数不足[1]格，无法打开礼包。",false,false)
            玩家:发送系统消息("背包剩余格数不足[1]格，无法打开礼包。")
        end
    end

    if 使用成功 then
        玩家:消耗背包物品(1, 物品)
        return 1
    end

    if 物品.物品编号 == 2319 then
        玩家:消耗背包物品(1, 物品)
        if 玩家.当前等级 < 35 then
            玩家:玩家增加经验(nil, 20000)
        elseif 玩家.当前等级 > 34 and 玩家.当前等级 < 40 then
            玩家:玩家增加经验(nil, 30000)
        elseif 玩家.当前等级 > 39 and 玩家.当前等级 < 45 then
            玩家:玩家增加经验(nil, 40000)
        elseif 玩家.当前等级 > 44 then
            玩家:玩家增加经验(nil, 50000)
        end
        return 1
    end
---------------------------------------------------------------------------------------------------------
    return 0
end

function 传永宝典职业沃玛戒指(玩家)
    if 玩家.角色职业 == 游戏对象职业.战士 then
      return 99930018
    elseif 玩家.角色职业 == 游戏对象职业.法师 then
      return 99930017
    elseif 玩家.角色职业 == 游戏对象职业.道士 then
      return 99930014
    elseif 玩家.角色职业 == 游戏对象职业.刺客 then
      return 99930048
    elseif 玩家.角色职业 == 游戏对象职业.弓手 then
      return 99930074
    elseif 玩家.角色职业 == 游戏对象职业.龙枪 then
      return 99930018
    else
      return 0
    end
end

function 传永宝典职业命运武器(玩家)
    if 玩家.角色职业 == 游戏对象职业.战士 then
      return 99900030
    elseif 玩家.角色职业 == 游戏对象职业.法师 then
      return 99900046
    elseif 玩家.角色职业 == 游戏对象职业.道士 then
      return 99900047
    elseif 玩家.角色职业 == 游戏对象职业.刺客 then
      return 99900061
    elseif 玩家.角色职业 == 游戏对象职业.弓手 then
      return 99900074
    elseif 玩家.角色职业 == 游戏对象职业.龙枪 then
      return 99900104
    else
      return 0
    end
end

function 灵石礼包本职业灵石(玩家)
    if 玩家.角色职业 == 游戏对象职业.战士 then
      return 10420
    elseif 玩家.角色职业 == 游戏对象职业.法师 then
      return 10320
    elseif 玩家.角色职业 == 游戏对象职业.道士 then
      return 10110
    elseif 玩家.角色职业 == 游戏对象职业.刺客 then
      return 10620
    elseif 玩家.角色职业 == 游戏对象职业.弓手 then
      return 10720
    elseif 玩家.角色职业 == 游戏对象职业.龙枪 then
      return 10820
    else
      return 0
    end
end

function 获取职业铭文石(玩家)
    if 玩家.角色职业 == 游戏对象职业.战士 then
      return 21001
    elseif 玩家.角色职业 == 游戏对象职业.法师 then
      return 21002
    elseif 玩家.角色职业 == 游戏对象职业.道士 then
      return 21003
    elseif 玩家.角色职业 == 游戏对象职业.刺客 then
      return 21004
    elseif 玩家.角色职业 == 游戏对象职业.弓手 then
      return 21005
    elseif 玩家.角色职业 == 游戏对象职业.龙枪 then
      return 21006
    else
      return 0
    end
end

function 获取职业武器精粹(玩家)
    if 玩家.角色职业 == 游戏对象职业.战士 then
      return 111058
    elseif 玩家.角色职业 == 游戏对象职业.法师 then
      return 111059
    elseif 玩家.角色职业 == 游戏对象职业.道士 then
      return 111060
    elseif 玩家.角色职业 == 游戏对象职业.刺客 then
      return 111078
    elseif 玩家.角色职业 == 游戏对象职业.弓手 then
      return 111091
    elseif 玩家.角色职业 == 游戏对象职业.龙枪 then
      return 111301
    else
      return 0
    end
end