function player_th(玩家, 礼包编号) --每周特惠
    local 六元礼包表 = {
        -- 双倍经验 金币 物品1 数量 数量2 数量 物品3 数量
        [0] = { 375000, 125000, 1370214, 1, 1500233, 1, 2339, 1},
        [1] = { 375000, 125000, 1370214, 1, 1500233, 1, 2340, 1},
        [3] = { 495000, 165000, 1370214, 1, 1500233, 1, 2341, 1},
        [4] = { 750000, 250000, 1370214, 1, 1500233, 1, 2342, 1},
        [5] = { 750000, 250000, 1370214, 1, 1500233, 1, 2343, 1},
        [7] = {1500000, 500000, 1370214, 1, 1500233, 1, 2343, 1},
    }
    local 三十元礼包表 = {
        -- 双倍经验 金币 物品1 数量 数量2 数量 物品3 数量
        [0] = { 375000, 200000, 90226, 60, 140001, 120, 91102, 5},
        [1] = { 375000, 200000, 90226, 60, 140001, 120, 91102, 5},
        [3] = { 495000, 200000, 90226, 60, 140001, 120, 91102, 5},
        [4] = { 750000, 200000, 90226, 60, 140002,  15, 91102, 5},
        [5] = { 750000, 200000, 90226, 60, 140002,  15, 91102, 5},
        [7] = {1500000, 200000, 90226, 60, 140002,  20, 91102, 5},
    }
    if 礼包编号 == 1 then
        玩家.双倍经验 = 玩家.双倍经验 + 六元礼包表[主程.开区节点][1]
        玩家.金币数量 = 玩家.金币数量 + 六元礼包表[主程.开区节点][2]
        玩家:玩家获得物品(六元礼包表[主程.开区节点][3], 六元礼包表[主程.开区节点][4], "6元宝礼包")
        玩家:玩家获得物品(六元礼包表[主程.开区节点][5], 六元礼包表[主程.开区节点][6], "6元宝礼包")
        玩家:玩家获得物品(六元礼包表[主程.开区节点][7], 六元礼包表[主程.开区节点][8], "6元宝礼包")
    elseif 礼包编号 == 2 then
        玩家.双倍经验 = 玩家.双倍经验 + 三十元礼包表[主程.开区节点][1]
        玩家.金币数量 = 玩家.金币数量 + 三十元礼包表[主程.开区节点][2]
        玩家:玩家获得物品(三十元礼包表[主程.开区节点][3], 三十元礼包表[主程.开区节点][4], "30元宝礼包")
        玩家:玩家获得物品(三十元礼包表[主程.开区节点][5], 三十元礼包表[主程.开区节点][6], "30元宝礼包")
        玩家:玩家获得物品(三十元礼包表[主程.开区节点][7], 三十元礼包表[主程.开区节点][8], "30元宝礼包")
    end
    return true  --真=true 假=false
end