local 对话页面表 = {
    [0] = 
    {
        "<#SO:1>首爆查询 = 沃玛套装<#SO/><#SO:2>首爆查询 = 祖玛套装<#SO/><#SO:3>首爆查询 = 赤月套装<#SO/><#SO:4>首爆查询 = 魔龙套装<#SO/><#SO:5>首爆查询 = 苍月套装<#SO/><#SO:6>首爆查询 = 星王套装<#SO/>"
    },
    [1] = 
    {
        "<#SO:100>炼狱         [50元宝]  获奖人：".. 系统数据.数据.脚本字符[100] .."<#SO/><#SO:100>魔杖         [50元宝]  获奖人：".. 系统数据.数据.脚本字符[101] .."<#SO/><#SO:100>银蛇         [50元宝]  获奖人：".. 系统数据.数据.脚本字符[102] .."<#SO/><#SO:100>重盔甲男  [20元宝]  获奖人：".. 系统数据.数据.脚本字符[103] .."<#SO/><#SO:100>重盔甲女  [20元宝]  获奖人：".. 系统数据.数据.脚本字符[104] .."<#SO/><#SO:100>魔法袍男  [20元宝]  获奖人：".. 系统数据.数据.脚本字符[105] .."<#SO/><#SO:100>魔法袍女  [20元宝]  获奖人：".. 系统数据.数据.脚本字符[106] .."<#SO/><#SO:100>灵魂衣男  [20元宝]  获奖人：".. 系统数据.数据.脚本字符[107] .."<#SO/><#SO:100>灵魂衣女  [20元宝]  获奖人：".. 系统数据.数据.脚本字符[108] .."<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [12] = 
    {
        "<#SO:100>道士头盔  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[109] .."<#SO/><#SO:100>幽灵项链  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[110] .."<#SO/><#SO:100>生命项链  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[111] .."<#SO/><#SO:100>天珠项链  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[112] .."<#SO/><#SO:100>幽灵手套  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[113] .."<#SO/><#SO:100>思贝手镯  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[114] .."<#SO/><#SO:100>心灵手镯  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[115] .."<#SO/><#SO:100>龙之戒指  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[116] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [122] = 
    {
        "<#SO:100>红宝石戒  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[117] .."<#SO/><#SO:100>铂金戒指  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[118] .."<#SO/><#SO:100>铁腰带　  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[119] .."<#SO/><#SO:100>鹿皮靴　  [10元宝]  获奖人：".. 系统数据.数据.脚本字符[120] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>返回首页<#SO/>"
    },

    [2] = 
    {
        "<#SO:100>井中月　[100元宝]  获奖人：".. 系统数据.数据.脚本字符[121] .."<#SO/><#SO:100>血　饮　[100元宝]  获奖人：".. 系统数据.数据.脚本字符[122] .."<#SO/><#SO:100>无极棍　[100元宝]  获奖人：".. 系统数据.数据.脚本字符[123] .."<#SO/><#SO:100>战神甲男  [50元宝]  获奖人：".. 系统数据.数据.脚本字符[124] .."<#SO/><#SO:100>战神甲女  [50元宝]  获奖人：".. 系统数据.数据.脚本字符[125] .."<#SO/><#SO:100>恶魔袍男  [50元宝]  获奖人：".. 系统数据.数据.脚本字符[126] .."<#SO/><#SO:100>恶魔袍女  [50元宝]  获奖人：".. 系统数据.数据.脚本字符[127] .."<#SO/><#SO:100>幽灵衣男  [50元宝]  获奖人：".. 系统数据.数据.脚本字符[128] .."<#SO/><#SO:100>幽灵衣女  [50元宝]  获奖人：".. 系统数据.数据.脚本字符[129] .."<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [22] = 
    {
        "<#SO:100>黑铁头盔  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[130] .."<#SO/><#SO:100>绿色项链  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[131] .."<#SO/><#SO:100>恶魔铃铛  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[132] .."<#SO/><#SO:100>灵魂项链  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[133] .."<#SO/><#SO:100>骑士手镯  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[134] .."<#SO/><#SO:100>阎罗手套  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[135] .."<#SO/><#SO:100>龙之手镯  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[136] .."<#SO/><#SO:100>三眼手镯  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[137] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [222] = 
    {
        "<#SO:100>力量戒指  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[138] .."<#SO/><#SO:100>紫碧螺戒  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[139] .."<#SO/><#SO:100>泰坦戒指  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[140] .."<#SO/><#SO:100>青铜腰带  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[141] .."<#SO/><#SO:100>紫绸靴　  [30元宝]  获奖人：".. 系统数据.数据.脚本字符[142] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>返回首页<#SO/>"
    },

    [3] = 
    {
        "<#SO:100>怒斩　　  [2千元宝]  获奖人：".. 系统数据.数据.脚本字符[143] .."<#SO/><#SO:100>龙牙　　  [2千元宝]  获奖人：".. 系统数据.数据.脚本字符[144] .."<#SO/><#SO:100>逍遥扇　  [2千元宝]  获奖人：".. 系统数据.数据.脚本字符[145] .."<#SO/><#SO:100>裁决之杖  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[146] .."<#SO/><#SO:100>骨玉权杖  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[147] .."<#SO/><#SO:100>龙纹剑　  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[148] .."<#SO/><#SO:100>天魔神甲  [500元宝]  获奖人：".. 系统数据.数据.脚本字符[149] .."<#SO/><#SO:100>圣战宝甲  [500元宝]  获奖人：".. 系统数据.数据.脚本字符[150] .."<#SO/><#SO:100>法神披风  [500元宝]  获奖人：".. 系统数据.数据.脚本字符[151] .."<#SO/><#SO:100>霓裳羽衣  [500元宝]  获奖人：".. 系统数据.数据.脚本字符[152] .."<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [32] = 
    {
        "<#SO:100>天尊道袍  [500元宝]  获奖人：".. 系统数据.数据.脚本字符[153] .."<#SO/><#SO:100>天师长袍  [500元宝]  获奖人：".. 系统数据.数据.脚本字符[154] .."<#SO/><#SO:100>圣战头盔  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[155] .."<#SO/><#SO:100>法神头盔  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[156] .."<#SO/><#SO:100>天尊头盔  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[157] .."<#SO/><#SO:100>圣战项链  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[158] .."<#SO/><#SO:100>法神项链  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[159] .."<#SO/><#SO:100>天尊项链  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[160] .."<#SO/><#SO:100>圣战手镯  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[161] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [322] = 
    {
        "<#SO:100>法神手镯  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[162] .."<#SO/><#SO:100>天尊手镯  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[163] .."<#SO/><#SO:100>圣战戒指  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[164] .."<#SO/><#SO:100>法神戒指  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[165] .."<#SO/><#SO:100>天尊戒指  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[166] .."<#SO/><#SO:100>钢铁腰带  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[167] .."<#SO/><#SO:100>避魂靴　  [100元宝]  获奖人：".. 系统数据.数据.脚本字符[168] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>返回首页<#SO/>"
    },

    [4] = 
    {
        "<#SO:100>屠龙宝刀  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[169] .."<#SO/><#SO:100>嗜魂法杖  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[170] .."<#SO/><#SO:100>倚天神剑  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[171] .."<#SO/><#SO:100>雷霆甲男  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[172] .."<#SO/><#SO:100>雷霆甲女  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[173] .."<#SO/><#SO:100>烈焰衣男  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[174] .."<#SO/><#SO:100>烈焰衣女  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[175] .."<#SO/><#SO:100>光芒衣男  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[176] .."<#SO/><#SO:100>光芒衣女  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[177] .."<#SO/><#SO:100>雷霆战盔  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[178] .."<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [42] = 
    {
        "<#SO:100>烈焰魔盔  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[179] .."<#SO/><#SO:100>光芒道盔  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[180] .."<#SO/><#SO:100>雷霆项链  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[181] .."<#SO/><#SO:100>烈焰项链  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[182] .."<#SO/><#SO:100>光芒项链  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[183] .."<#SO/><#SO:100>雷霆护腕  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[184] .."<#SO/><#SO:100>烈焰护腕  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[185] .."<#SO/><#SO:100>光芒护腕  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[186] .."<#SO/><#SO:100>雷霆战戒  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[187] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [422] = 
    {
        "<#SO:100>烈焰魔戒  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[188] .."<#SO/><#SO:100>光芒道戒  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[189] .."<#SO/><#SO:100>雷霆腰带  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[190] .."<#SO/><#SO:100>烈焰腰带  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[191] .."<#SO/><#SO:100>光芒腰带  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[192] .."<#SO/><#SO:100>雷霆战靴  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[193] .."<#SO/><#SO:100>烈焰魔靴  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[194] .."<#SO/><#SO:100>光芒道靴  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[195] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>返回首页<#SO/>"
    },

    [5] = 
    {
        "<#SO:100>黄金屠龙  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[196] .."<#SO/><#SO:100>紫金嗜魂  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[197] .."<#SO/><#SO:100>赤金倚天  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[198] .."<#SO/><#SO:100>凤天魔甲  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[199] .."<#SO/><#SO:100>凰天魔衣  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[200] .."<#SO/><#SO:100>战神头盔  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[201] .."<#SO/><#SO:100>圣魔头盔  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[202] .."<#SO/><#SO:100>真魂头盔  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[203] .."<#SO/><#SO:100>战神项链  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[204] .."<#SO/><#SO:100>圣魔项链  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[205] .."<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [52] = 
    {
        "<#SO:100>真魂项链  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[206] .."<#SO/><#SO:100>战神手镯  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[207] .."<#SO/><#SO:100>圣魔手镯  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[208] .."<#SO/><#SO:100>真魂手镯  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[209] .."<#SO/><#SO:100>战神戒指  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[210] .."<#SO/><#SO:100>圣魔戒指  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[211] .."<#SO/><#SO:100>真魂戒指  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[212] .."<#SO/><#SO:100>战神腰带  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[213] .."<#SO/><#SO:100>圣魔腰带  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[214] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [522] = 
    {
        "<#SO:100>真魂腰带  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[215] .."<#SO/><#SO:100>战神靴子  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[216] .."<#SO/><#SO:100>圣魔靴子  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[217] .."<#SO/><#SO:100>真魂靴子  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[218] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>返回首页<#SO/>"
    },

    [6] = 
    {
        "<#SO:100>开天　　  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[219] .."<#SO/><#SO:100>镇天　　  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[220] .."<#SO/><#SO:100>玄天　　  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[221] .."<#SO/><#SO:100>星王甲男  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[222] .."<#SO/><#SO:100>星王甲女  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[223] .."<#SO/><#SO:100>星王袍男  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[224] .."<#SO/><#SO:100>星王袍女  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[225] .."<#SO/><#SO:100>星王衣男  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[226] .."<#SO/><#SO:100>星王衣女  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[227] .."<#SO/><#SO:100>星王战盔  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[228] .."<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [62] = 
    {
        "<#SO:100>星王法盔  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[229] .."<#SO/><#SO:100>星王道盔  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[230] .."<#SO/><#SO:100>星王战链  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[231] .."<#SO/><#SO:100>星王法链  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[232] .."<#SO/><#SO:100>星王道链  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[233] .."<#SO/><#SO:100>星王战镯  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[234] .."<#SO/><#SO:100>星王法镯  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[235] .."<#SO/><#SO:100>星王道镯  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[236] .."<#SO/><#SO:100>星王战戒  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[237] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [622] = 
    {
        "<#SO:100>星王法戒  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[238] .."<#SO/><#SO:100>星王道戒  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[239] .."<#SO/><#SO:100>星王腰带  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[240] .."<#SO/><#SO:100>星王靴子  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[241] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>返回首页<#SO/>"
    },
    [7] = 
    {
        "<#SO:100>尸王　　  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[300] .."<#SO/><#SO:100>触龙神　  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[220] .."<#SO/><#SO:100>沃玛教主  [5千元宝]  获奖人：".. 系统数据.数据.脚本字符[221] .."<#SO/><#SO:100>虹魔教主  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[222] .."<#SO/><#SO:100>祖玛教主  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[223] .."<#SO/><#SO:100>血手　　  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[224] .."<#SO/><#SO:100>烈焰恶魔  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[225] .."<#SO/><#SO:100>赤月恶魔  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[226] .."<#SO/><#SO:100>兽大祭司  [1千元宝]  获奖人：".. 系统数据.数据.脚本字符[227] .."<#SO/><#SO:100>魔龙教主  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[228] .."<#SO/><#SO:2>下  一  页<#SO/>"
    },
    [72] = 
    {
        "<#SO:100>石原恶魔  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[229] .."<#SO/><#SO:100>凋零树妖  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[230] .."<#SO/><#SO:100>牛魔王　  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[231] .."<#SO/><#SO:100>远古巨灵  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[232] .."<#SO/><#SO:100>黄泉教主  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[233] .."<#SO/><#SO:100>巨兽魔王  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[234] .."<#SO/><#SO:100>龙裔霸主  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[235] .."<#SO/><#SO:100>元素之心  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[236] .."<#SO/><#SO:100>魔火龙　  [300元宝]  获奖人：".. 系统数据.数据.脚本字符[237] .."<#SO/><#SO:1>上  一  页<#SO/><#SO:2>下  一  页<#SO/>"
    },
}

local 返回页面表 = {
    [110] = {1},
    [121] = {1}, --上一页
    [220] = {12},
    [1221] = {12}, --上一页
    [1320] = {122},
    [1222] = {0},

    [120] = {2},
    [221] = {2},
    [320] = {22},
    [2221] = {22},
    [2320] = {222},
    [2222] = {0},

    [130] = {3},
    [321] = {3},
    [420] = {32},
    [3221] = {32},
    [3320] = {322},
    [3222] = {0},

    [140] = {4},
    [421] = {4},
    [520] = {42},
    [4221] = {42},
    [4320] = {422},
    [4222] = {0},

    [150] = {5},
    [521] = {5},
    [620] = {52},
    [5221] = {52},
    [5320] = {522},
    [5222] = {0},

    [160] = {6},
    [621] = {6},
    [720] = {62},
    [6221] = {62},
    [6320] = {622},
    [6222] = {0},
}

function 首爆首杀查询_主对话(玩家, 对话守卫, 选项编号, 界面层数)
    if 对话页面表[玩家.对话页面] ~= nil then
        return 对话页面表[玩家.对话页面][1]
    end

    if 返回页面表[玩家.对话页面] ~= nil then
        玩家.对话页面 = 返回页面表[玩家.对话页面][1]
        return 对话页面表[玩家.对话页面][1]
    end
end
return 首爆首杀查询_主对话