-- function 盟重省_哨探_主对话(玩家, 对话守卫, 选项编号, 界面层数)
--   if 玩家.对话页面 == 0 then
--     return "为了排查游戏偶尔卡顿的问题，暂时关闭副本，等级达到[40]级可在我这里领取补偿！<#SO:1>领取副本补偿<#SO/>"
--   end
  
--   if 玩家.对话页面 == 1 then
--     if 玩家.本期特权 == 3 or 玩家.本期特权 == 4 or 玩家.本期特权 == 5 or 玩家.本期特权 == 7 then
--       if 玩家.角色数据.脚本变量[数字_副本临时领取开关] == 本年天数 then
--         return "今日已领取补偿奖励，无法重复领取！"
--       elseif 玩家.当前等级 < 35 then
--         return "很遗憾，等级未达到[35]级，无法领取补偿奖励！"
--       else
--         玩家.银币数量 = 玩家.银币数量 + 1000000
--         玩家:玩家获得物品(91184, 1, "副本补偿获取", true)
--         玩家:玩家获得物品(91211, 1, "副本补偿获取", true)
--         玩家:玩家获得物品(获取职业铭文石(玩家), 20, "副本补偿获取", true)
--         玩家.角色数据.脚本变量[数字_副本临时领取开关] = 本年天数
--         return "副本补偿领取成功！"
--       end
--     else
--       return "玛法豪杰以上特权才可领取。"
--     end
--   end
-- end
-- return 盟重省_哨探_主对话


function 盟重省_哨探_主对话(玩家, 对话守卫, 选项编号, 界面层数)
  local 当前星期 = tonumber(os.date("%w"))

  if 玩家.对话页面 == 0 then
    --请问你想去哪里<#SO:1>屠魔大厅<#SO/><#SO:2>挑战副本<#SO/><#SO:3>蜘蛛长廊<#SO/><#SO:4>魔龙幻境<#SO/>
    return "<#P0:0><#P1:0><#T:700451>"
  end
  ----------------------------------------------------------------------------------------------------------屠魔大厅
  if 玩家.对话页面 == 1 then
    if 当前星期 == 2 or 当前星期 == 4 or 当前星期 == 6 or 当前星期 == 0 then
      --欢迎挑战屠魔大厅，最多可供3位勇士组队进入。每日挑战次数不限，但每日只能领取1种屠魔奖励，每日24点将重置领取次数，请大家在此之前完成领取！是否现在开启挑战？<#SO:1>进入屠魔大厅<#SO/><#SO:2>挑战屠魔秘境(标准)<#SO/><#SO:3>挑战屠魔秘境(进阶)<#SO/><#SO:5>领取今日屠魔奖励<#SO/>
      return "<#P0:0><#P1:0><#T:710347>"
    else
      return "当前不在活动时间，屠魔大厅仅在每周二，四，六、日开放。<#SO:999999>知道了<#SO/>"
      -- return "<#P0:0><#P1:0><#T:700448>"
    end
  end

  if 玩家.对话页面 == 11 then
    --您选择挑战屠魔大厅，请问想要通过哪种消耗方式进入呢？<#SO:1>消耗10万金币<#SO/><#SO:2>消耗3灵符<#SO/><#SO:3>我再考虑一下<#SO/>
    return "<#P0:0><#P1:0><#T:710333>"
  end

  if 玩家.对话页面 == 12 then
    if 主程.开区节点 < 4 then
      return "<#P0:0><#P1:0><#T:666476>"
    else
      return "<#P0:0><#P1:0><#T:710334>"
    end
    --您选择挑战屠魔秘境(标准)，请问想要通过哪种消耗方式进入呢？<#SO:1>消耗10万金币<#SO/><#SO:2>消耗3灵符<#SO/><#SO:3>我再考虑一下<#SO/>
  end

  if 玩家.对话页面 == 13 then
    if 主程.开区节点 < 7 then
      return "<#P0:0><#P1:0><#T:666476>"
    else
    --您选择挑战屠魔秘境(进阶)，请问想要通过哪种消耗方式进入呢？<#SO:1>消耗10万金币<#SO/><#SO:2>消耗3灵符<#SO/><#SO:3>我再考虑一下<#SO/>
      return "<#P0:0><#P1:0><#T:710335>"
    end
  end

  if 玩家.对话页面 == 15 then
    if 玩家.角色数据.脚本变量[数字_屠魔大厅每日领取记录] == tonumber(os.date("%j")) then --检测每次次数是否等于今天
      --勇士，您已领取过今日的奖励了，请来日再战。
      return "<#P0:0><#P1:0><#T:710359>"
    elseif 玩家.角色数据.脚本变量[数字_屠魔大厅进阶层数记录] == 2 then
      --今日最佳除魔记录：`~层(进阶)。是否确认领取奖励？<#SO:1>确认领取<#SO/><#SO:2>我再想想<#SO/>
      return "<#P0:".. 玩家.角色数据.脚本变量[数字_屠魔大厅进阶层数记录] .."><#P1:0><#T:990582>"
    elseif 玩家.角色数据.脚本变量[数字_屠魔大厅标准层数记录] == 2 then
      --今日最佳除魔记录：`~层(标准)。是否确认领取奖励？<#SO:1>确认领取<#SO/><#SO:2>我再想想<#SO/>
      return "<#P0:".. 玩家.角色数据.脚本变量[数字_屠魔大厅标准层数记录] .."><#P1:0><#T:990581>"
    elseif 玩家.角色数据.脚本变量[数字_屠魔大厅普通层数记录] > 0 then
      --今日最佳屠魔记录：`~波。是否确认领取奖励？<#SO:1>确认领取<#SO/><#SO:2>我再想想<#SO/>
      return "<#P0:".. 玩家.角色数据.脚本变量[数字_屠魔大厅普通层数记录] .."><#P1:0><#T:710361>"
    else
      ----您今日的屠魔战果尚不足令人信服，暂时无法领取奖励，请继续努力！
      return "<#P0:0><#P1:0><#T:710358>"
    end
  end

  if 玩家.对话页面 == 111 then
    return "<#P0:".. 玩家.角色数据.脚本变量[数字_屠魔大厅普通层数记录] .."><#P1:0><#T:710389>"
  end

  if 玩家.对话页面 == 112 then
    return "<#P0:".. 玩家.角色数据.脚本变量[数字_屠魔大厅普通层数记录] .."><#P1:0><#T:710389>"
  end

  if 玩家.对话页面 == 121 then
    return "<#P0:".. 玩家.角色数据.脚本变量[数字_屠魔大厅标准层数记录] .."><#P1:0><#T:710389>"
  end

  if 玩家.对话页面 == 122 then
    return "<#P0:".. 玩家.角色数据.脚本变量[数字_屠魔大厅标准层数记录] .."><#P1:0><#T:710389>"
  end

  if 玩家.对话页面 == 131 then
    return "<#P0:".. 玩家.角色数据.脚本变量[数字_屠魔大厅进阶层数记录] .."><#P1:0><#T:710389>"
  end

  if 玩家.对话页面 == 132 then
    return "<#P0:".. 玩家.角色数据.脚本变量[数字_屠魔大厅进阶层数记录] .."><#P1:0><#T:710389>"
  end

  if 玩家.对话页面 == 151 then
    local 屠魔大厅层数奖励表 = {
      [0] = {94041},
      [1] = {94041},
      [2] = {94042},
      [3] = {94043},
      [4] = {94044},
      [5] = {94045},
      [6] = {94046},
      [7] = {94047},
      [8] = {94048},
      [9] = {94049},
      [10] = {94050},
      [11] = {94051},
      [12] = {94052},
      [13] = {94053},
      [14] = {94054},
      [15] = {94055}
    }
    if 玩家.角色数据.脚本变量[数字_屠魔大厅进阶层数记录] == 2 then
      玩家:玩家获得物品(94057, 1)
    elseif 玩家.角色数据.脚本变量[数字_屠魔大厅标准层数记录] == 2 then
      玩家:玩家获得物品(94056, 1)
    elseif 玩家.角色数据.脚本变量[数字_屠魔大厅普通层数记录] > 0 then
      玩家:玩家获得物品(屠魔大厅层数奖励表[玩家.角色数据.脚本变量[数字_屠魔大厅普通层数记录]][1],1)
    end
    玩家:修改角色变量(数字_屠魔大厅每日领取, 计算类.时间转换(主程.当前时间.Date))
    玩家.角色数据.脚本变量[数字_屠魔大厅每日领取记录] = tonumber(os.date("%j"))
    玩家:修改战功任务(14, 1)
  end

  if 玩家.对话页面 == 1111 or 玩家.对话页面 == 1121 or 玩家.对话页面 == 1211 or 玩家.对话页面 == 1221 or 玩家.对话页面 == 1311 or 玩家.对话页面 == 1321 then
    if 玩家.所属队伍 == nil then
      return "<#P0:0><#P1:0><#T:50603>"
    elseif 玩家.所属队伍.队长编号 ~= 玩家.地图编号 then
      return "<#P0:0><#P1:0><#T:990109>"
    elseif 玩家.所属队伍.队伍成员.Count > 3 then
      return "<#P0:0><#P1:0><#T:710353>" --屠魔大厅过于狭窄，最多只能容纳`~名勇士同时进入。
    else
      local 玩家列表 = 获取在线队友(玩家)
      if 玩家.对话页面 == 1111 or 玩家.对话页面 == 1211 or 玩家.对话页面 == 1311 then
        for key, value in pairs(玩家列表) do
          local 队员 = value
          if 队员.金币数量 < 100000 then
            return "<#P0:100000><#P1:0><#T:710355>" --传入屠魔大厅需扣除每位队伍成员`~金币，似乎有人准备不足啊。
          end
        end
      end

      if 玩家.对话页面 == 1121 or 玩家.对话页面 == 1221 or 玩家.对话页面 == 1321 then
        for key, value in pairs(玩家列表) do
          local 队员 = value
          local 物品 = 队员:查找背包物品(90226, 3) --灵符
          if 物品 == nil then
            return "<#P0:3><#P1:0><#T:700382>" --传入该地图需扣除每位队伍成员`~灵符，似乎有人准备不足啊。
          end
        end
      end

      local 屠魔大厅 = 创建副本(80)
      if 屠魔大厅 ~= nil then
        if 玩家.对话页面 == 1111 or 玩家.对话页面 == 1121 then
          屠魔大厅.数字变量[数字_屠魔大厅级别] = 0
        elseif 玩家.对话页面 == 1211 or 玩家.对话页面 == 1221 then
          屠魔大厅.数字变量[数字_屠魔大厅级别] = 1
        elseif 玩家.对话页面 == 1311 or 玩家.对话页面 == 1321 then
          屠魔大厅.数字变量[数字_屠魔大厅级别] = 2
        end
        屠魔大厅.节点计时 = 主程.当前时间:AddSeconds(10.0)
        local 玩家列表 = 获取在线队友(玩家)
        for key, value in pairs(玩家列表) do
          local 队员 = value
          local 物品 = 队员:查找背包物品(90226, 3) --灵符
          if 玩家.对话页面 == 1111 or 玩家.对话页面 == 1211 or 玩家.对话页面 == 1311 then
            队员.金币数量 = 队员.金币数量 - 100000
          else
            队员:消耗背包物品(3, 物品)
          end
          if 玩家.对话页面 == 1111 or 玩家.对话页面 == 1121 then
            队员:玩家切换地图(屠魔大厅, 地图区域类型.传送区域)
          else
            队员:玩家切换地图(屠魔大厅, 地图区域类型.未知区域, Point(1092, 362))
          end
          if 队员.开启七天乐 then
            队员:修改七天进度(58, 玩家.角色数据.七天进度[58] + 1)
          end
        end
      end
    end
  end
  
  ----------------------------------------------------------------------------------------------------------挑战副本
  if 玩家.对话页面 == 2 then
     --请问你想挑战哪个副本呢<br>友情提醒：无相之境与魔虫窟共享挑战次数<#SO:1>魔虫窟<#SO/><#SO:2>无相之境<#SO/>
    return "<#P0:0><#P1:0><#T:666846>"
  end

  if 玩家.对话页面 == 21 then
    --我知道如何去往魔虫窟，那是个凶险无比的地方，只有依靠团队的力量才能存活，所以你必须组队前往。另外你的等级要达到25级，并且交给我1张“魔虫窟入场券”或“副本入场券”，我就能给你指点道路。（每天只能进入一次。）<#SO:1>进入魔虫窟<#SO/><#SO:2>取消<#SO/>
    return "<#P0:0><#P1:0><#T:50601>"
  end

  if 玩家.对话页面 == 22 then
    if 主程.开区节点 < 5 then
      return "<#P0:0><#P1:0><#T:666472>"
    else
      return "无相秘境正在紧急制作中，具体开放时间请等待公布！"
    end
  end

  if 玩家.对话页面 == 211 then
    if 玩家.所属队伍 == nil then
      return "<#P0:0><#P1:0><#T:50603>" --你不在队伍当中。
    elseif 玩家.所属队伍.队长编号 ~= 玩家.地图编号 then
      return "<#P0:0><#P1:0><#T:990109>" --你不是队长，请等待队长操作！
    else
      local 玩家列表 = 获取在线队友(玩家)
      for key, value in pairs(玩家列表) do
        local 队员 = value
        local 物品1 = 队员:根据编号获取背包物品(91194)
        local 物品2 = 队员:根据编号获取背包物品(91195)
        if 队员.当前等级 < 25 then
          return "<#P0:0><#P1:0><#T:50606>" --不好意思，您的等级不足，请到达25级以后再来。<#SO:1>确定<#SO/>
        elseif 物品1 == nil and 物品2 == nil then
          return "<#P0:0><#P1:0><#T:700393>" --传入魔虫窟需扣除每位队伍成员1张“魔虫窟入场券”或“副本入场券”，似乎有人准备不足啊。
        elseif 队员.角色数据.脚本变量[数字_魔虫窟每日进入次数] == 1 then
          return "玩家：[".. 队员.对象名字 .."]今天已经去过魔虫窟了。<#SO:999999>确定<#SO/>"
        end
      end

      local 魔虫窟 = 创建副本(72)
      if 魔虫窟 ~= nil then
        魔虫窟.关闭时间 = 主程.当前时间:AddHours(2.0)
        魔虫窟.副本主人 = 玩家.地图编号
        魔虫窟:初始化副本怪物(180)
        魔虫窟:初始化副本守卫()
        魔虫窟.节点计时 = 主程.当前时间:AddSeconds(10.0)
        local 玩家列表 = 获取在线队友(玩家)
        for key, value in pairs(玩家列表) do
          local 队员 = value
          local 物品1 = 队员:根据编号获取背包物品(91194)
          local 物品2 = 队员:根据编号获取背包物品(91195)
          if 物品1 ~= nil then
            队员:消耗背包物品(1, 物品1)
          else
            队员:消耗背包物品(1, 物品2)
          end
          队员.角色数据.脚本变量[数字_魔虫窟每日进入次数] = 1
          -- 队员:修改角色变量(数字_魔虫窟每日进入次数, 计算类.时间转换(主程.当前时间.Date))
          队员:玩家切换地图(魔虫窟, 地图区域类型.传送区域)
          队员:添加Buff时处理(2554, nil)
          if 队员.开启七天乐 then
            队员:修改七天进度(68, 玩家.角色数据.七天进度[68] + 1)
          end
        end
      end
    end
  end
----------------------------------------------------------------------------------------------------------蜘蛛长廊
  if 玩家.对话页面 == 3 then
    if 当前星期 == 2 or 当前星期 == 4 or 当前星期 == 6 or 当前星期 == 0 then
    --蜘蛛长廊每周二、四、六、日全天开放，等级达到`~级的玩家可组队后由队长传送进入，玩家每日仅限进入一次。蜘蛛长廊随游戏进度会开放不同难度供玩家选择，并根据选择的难度和完成的层数提供不同的宝箱奖励。<#SO:1>蜘蛛长廊（标准）<#SO/><#SO:6>领取蜘蛛长廊奖励<#SO/>
    -- return "<#P0:30><#P1:0><#T:700354>"
    --蜘蛛长廊每周二、四、六、日全天开放，等级达到`~级的玩家可组队后由队长传送进入，玩家每日仅限进入一次。蜘蛛长廊随游戏进度会开放不同难度供玩家选择，并根据选择的难度和完成的层数提供不同的宝箱奖励。<#SO:1>蜘蛛长廊（标准）<#SO/><#SO:2>蜘蛛长廊（进阶）<#SO/><#SO:6>领取蜘蛛长廊奖励<#SO/>
    -- return "<#P0:30><#P1:0><#T:700355>"
    --蜘蛛长廊每周二、四、六、日全天开放，等级达到`~级的玩家可组队后由队长传送进入，玩家每日仅限进入一次。蜘蛛长廊随游戏进度会开放不同难度供玩家选择，并根据选择的难度和完成的层数提供不同的宝箱奖励。<#SO:1>蜘蛛长廊（标准）<#SO/><#SO:2>蜘蛛长廊（进阶）<#SO/><#SO:3>蜘蛛长廊（困难）<#SO/><#SO:6>领取蜘蛛长廊奖励<#SO/>
    return "<#P0:30><#P1:0><#T:700356>"
    else
      return "当前不在活动时间，蜘蛛长廊仅在每周二，四，六、日开放。<#SO:999999>知道了<#SO/>"
      -- return "<#P0:0><#P1:0><#T:700448>"
    end
  end

  if 玩家.对话页面 == 31 then
    --您当前选择挑战的是“蜘蛛长廊（标准）”难度，难度越高，刷新怪物的数量越多，同时怪物会获得随机的属性强化，准备好了就开始您的挑战吧！<#SO:1>使用金币传送进入蜘蛛长廊 (每人10万金币)<#SO/><#SO:2>使用灵符传送进入蜘蛛长廊 (每人3个灵符)<#SO/><#SO:3>我再想想<#SO/>
    return "<#P0:0><#P1:0><#T:700357>"
  end

  if 玩家.对话页面 == 32 then
    if 主程.开区节点 < 4 then
      return "<#P0:0><#P1:0><#T:991150>"
    else
    --您当前选择挑战的是“蜘蛛长廊（进阶）”难度，难度越高，刷新怪物的数量越多，同时怪物会获得随机的属性强化，准备好了就开始您的挑战吧！<#SO:1>使用金币传送进入蜘蛛长廊 (每人10万金币)<#SO/><#SO:2>使用灵符传送进入蜘蛛长廊 (每人3个灵符)<#SO/><#SO:3>我再想想<#SO/>
      return "<#P0:0><#P1:0><#T:700358>"
    end
  end

  if 玩家.对话页面 == 33 then
    if 主程.开区节点 < 7 then
      return "<#P0:0><#P1:0><#T:666476>"
    else
    --您当前选择挑战的是“蜘蛛长廊（困难）”难度，难度越高，刷新怪物的数量越多，同时怪物会获得随机的属性强化，准备好了就开始您的挑战吧！<#SO:1>使用金币传送进入蜘蛛长廊 (每人10万金币)<#SO/><#SO:2>使用灵符传送进入蜘蛛长廊 (每人3个灵符)<#SO/><#SO:3>我再想想<#SO/>
      return "<#P0:0><#P1:0><#T:700359>"
    end
  end

  if 玩家.对话页面 == 36 then
    if 玩家.角色数据.脚本变量[数字_蜘蛛长廊每日领取记录] == tonumber(os.date("%j")) then --检测每次次数是否等于今天
      --勇士，您已领取过今日的奖励了，请来日再战。
      return "<#P0:0><#P1:0><#T:700387>"
    elseif 玩家.角色数据.脚本变量[数字_蜘蛛长廊困难层数记录] > 0 then
      --今日最佳蜘蛛长廊记录：困难难度[`~]层。是否确认领取奖励？<#SO:1>确认领取<#SO/><#SO:2>我再想想<#SO/>
      return "<#P0:".. 玩家.角色数据.脚本变量[数字_蜘蛛长廊困难层数记录] .."><#P1:0><#T:700378>"
    elseif 玩家.角色数据.脚本变量[数字_蜘蛛长廊进阶层数记录] > 0 then
      --今日最佳蜘蛛长廊记录：进阶难度[`~]层。是否确认领取奖励？<#SO:1>确认领取<#SO/><#SO:2>我再想想<#SO/>
      return "<#P0:".. 玩家.角色数据.脚本变量[数字_蜘蛛长廊进阶层数记录] .."><#P1:0><#T:700377>"
    elseif 玩家.角色数据.脚本变量[数字_蜘蛛长廊标准层数记录] > 0 then
      --今日最佳蜘蛛长廊记录：标准难度[`~]层。是否确认领取奖励？<#SO:1>确认领取<#SO/><#SO:2>我再想想<#SO/>
      return "<#P0:".. 玩家.角色数据.脚本变量[数字_蜘蛛长廊标准层数记录] .."><#P1:0><#T:700376>"
    else
      --您今日的蜘蛛长廊闯关战果尚不足令人信服，暂时无法领取奖励，请继续努力！
      return "<#P0:0><#P1:0><#T:700386>"
    end
  end

  if 玩家.对话页面 == 311 or 玩家.对话页面 == 312 or 玩家.对话页面 == 321 or 玩家.对话页面 == 322 or 玩家.对话页面 == 331 or 玩家.对话页面 == 332 then  --蜘蛛长廊
    if 玩家.所属队伍 == nil then
      --你不在队伍中。<#SO:1>确定<#SO/>
      return "<#P0:0><#P1:0><#T:50603>"
    elseif 玩家.所属队伍.队长编号 ~= 玩家.地图编号 then
      --勇士你不是队长，请等待队长操作！
      return "<#P0:0><#P1:0><#T:990109>"
    elseif 玩家.所属队伍.队伍成员.Count > 3 then
      --该地图最多只能容纳`~名勇士同时进入。
      return "<#P0:3><#P1:0><#T:700380>"
    else
      local 玩家列表 = 获取在线队友(玩家)
      if 玩家.对话页面 == 311 or 玩家.对话页面 == 321 or 玩家.对话页面 == 331 then
        for key, value in pairs(玩家列表) do
          local 队员 = value
          if 队员.角色数据.脚本变量[数字_蜘蛛长廊每日进入次数] == 1 then
            --[`~]今天已经挑战过了。
            return "<#P0:".. 队员.对象名字 .."><#P1:0><#T:700383>"
          elseif 队员.金币数量 < 100000 then
            --传入该地图需扣除每位队伍成员`~金币，似乎有人准备不足啊。
            return "<#P0:100000><#P1:0><#T:700381>"
          end
        end
      end

      if 玩家.对话页面 == 312 or 玩家.对话页面 == 322 or 玩家.对话页面 == 332 then
        for key, value in pairs(玩家列表) do
          local 队员 = value
          local 物品 = 队员:查找背包物品(90226, 3) --灵符
          if 队员.角色数据.脚本变量[数字_蜘蛛长廊每日进入次数] == 1 then
            --[`~]今天已经挑战过了。
            return "<#P0:".. 队员.对象名字 .."><#P1:0><#T:700383>"
          elseif 物品 == nil then
            --传入该地图需扣除每位队伍成员`~灵符，似乎有人准备不足啊。
            return "<#P0:3><#P1:0><#T:700382>"
          end
        end
      end

      local 蜘蛛长廊 = 创建副本(73)
      if 蜘蛛长廊 ~= nil then
        if 玩家.对话页面 == 311 or 玩家.对话页面 == 312 then
          蜘蛛长廊.数字变量[数字_蜘蛛长廊级别] = 0
        elseif 玩家.对话页面 == 321 or 玩家.对话页面 == 322 then
          蜘蛛长廊.数字变量[数字_蜘蛛长廊级别] = 1
        elseif 玩家.对话页面 == 331 or 玩家.对话页面 == 332 then
          蜘蛛长廊.数字变量[数字_蜘蛛长廊级别] = 2
        end
        蜘蛛长廊.节点计时 = 主程.当前时间:AddSeconds(10.0)
        local 玩家列表 = 获取在线队友(玩家)
        for key, value in pairs(玩家列表) do
          local 队员 = value
          local 物品 = 队员:查找背包物品(90226, 3) --灵符
          if 玩家.对话页面 == 311 or 玩家.对话页面 == 321 or 玩家.对话页面 == 331 then
            队员.金币数量 = 队员.金币数量 - 100000
          else
            队员:消耗背包物品(3, 物品)
          end
          队员.角色数据.脚本变量[数字_蜘蛛长廊每日进入次数] = 1
          队员:玩家切换地图(蜘蛛长廊, 地图区域类型.未知区域, Point(887, 284))
        end
      end
    end
  end

  if 玩家.对话页面 == 361 then
    local 蜘蛛长廊困难宝箱 = {
      [1] = {94066},
      [2] = {94067},
      [3] = {94068},
    }
    local 蜘蛛长廊进阶宝箱 = {
      [1] = {94063},
      [2] = {94064},
      [3] = {94065},
    }
    local 蜘蛛长廊标准宝箱 = {
      [1] = {94060},
      [2] = {94061},
      [3] = {94062},
    }
    if 玩家.角色数据.脚本变量[数字_蜘蛛长廊困难层数记录] ~= 0 then
      玩家:玩家获得物品(蜘蛛长廊困难宝箱[玩家.角色数据.脚本变量[数字_蜘蛛长廊困难层数记录]][1], 1)
    elseif 玩家.角色数据.脚本变量[数字_蜘蛛长廊进阶层数记录] ~= 0 then
      玩家:玩家获得物品(蜘蛛长廊进阶宝箱[玩家.角色数据.脚本变量[数字_蜘蛛长廊进阶层数记录]][1], 1)
    elseif 玩家.角色数据.脚本变量[数字_蜘蛛长廊标准层数记录] ~= 0 then
      玩家:玩家获得物品(蜘蛛长廊标准宝箱[玩家.角色数据.脚本变量[数字_蜘蛛长廊标准层数记录]][1], 1)
    end
    玩家.角色数据.脚本变量[数字_蜘蛛长廊每日领取记录] = tonumber(os.date("%j"))
  end
----------------------------------------------------------------------------------------------------------蜘蛛长廊

  if 玩家.对话页面 == 223 then
    玩家:玩家切换地图(40, 1010, 287, 0)
  end

end
return 盟重省_哨探_主对话